MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/**
  ******************************************************************************
  * @file    stm32c542xx.h
  * @brief   CMSIS STM32C542xx Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef STM32C542xx_H
#define STM32C542xx_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup ST
  * @{
  */


/** @addtogroup STM32C542xx
  * @{
  */


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================================================== */
/* ==========                                 Interrupt Number Definition                                  ========== */
/* ================================================================================================================== */

typedef enum
{
/* ==================================  ARM Cortex-M33 Specific Interrupt Numbers  =================================== */
  Reset_IRQn                 = -15, /*!< -15 Reset                                                                    */
  NonMaskableInt_IRQn        = -14, /*!< -14 Non maskable interrupt. The RCC Clock Security System (CSS) is linked to
                                             the NMI vector.                                                          */
  HardFault_IRQn             = -13, /*!< -13 Hard fault                                                               */
  MemoryManagement_IRQn      = -12, /*!< -12 Memory management                                                        */
  BusFault_IRQn              = -11, /*!< -11 Pre-fetch fault, memory access fault                                     */
  UsageFault_IRQn            = -10, /*!< -10 Undefined instruction or illegal state                                   */
  SVCall_IRQn                =  -5, /*!<  -5 System service call via SWI instruction                                  */
  DebugMonitor_IRQn          =  -4, /*!<  -4 Debug monitor                                                            */
  PendSV_IRQn                =  -2, /*!<  -2 Pendable request for system service                                      */
  SysTick_IRQn               =  -1, /*!<  -1 System tick timer                                                        */
/* ==================================  STM32C542xx Specific Interrupt Numbers  ================================= */
  WWDG_IRQn                  =   0, /*!< Window Watchdog interrupt                                                    */
  PWR_PVD_IRQn               =   1, /*!< Power Voltage Monitor                                                        */
  RTC_IRQn                   =   2, /*!< RTC global non-secure interrupts                                             */
  TAMP_IRQn                  =   3, /*!< Tamper global interrupts                                                     */
  RAMCFG_IRQn                =   4, /*!< RAM configuration global interrupt                                           */
  FLASH_IRQn                 =   5, /*!< Flash non-secure global interrupt                                            */
  RCC_IRQn                   =   6, /*!< RCC non-secure global interrupt                                              */
  EXTI0_IRQn                 =   7, /*!< EXTI Line0 interrupt                                                         */
  EXTI1_IRQn                 =   8, /*!< EXTI Line1 interrupt                                                         */
  EXTI2_IRQn                 =   9, /*!< EXTI Line2 interrupt                                                         */
  EXTI3_IRQn                 =  10, /*!< EXTI Line3 interrupt                                                         */
  EXTI4_IRQn                 =  11, /*!< EXTI Line4 interrupt                                                         */
  EXTI5_IRQn                 =  12, /*!< EXTI Line5 interrupt                                                         */
  EXTI6_IRQn                 =  13, /*!< EXTI Line6 interrupt                                                         */
  EXTI7_IRQn                 =  14, /*!< EXTI Line7 interrupt                                                         */
  EXTI8_IRQn                 =  15, /*!< EXTI Line8 interrupt                                                         */
  EXTI9_IRQn                 =  16, /*!< EXTI Line9 interrupt                                                         */
  EXTI10_IRQn                =  17, /*!< EXTI Line10 interrupt                                                        */
  EXTI11_IRQn                =  18, /*!< EXTI Line11 interrupt                                                        */
  EXTI12_IRQn                =  19, /*!< EXTI Line12 interrupt                                                        */
  EXTI13_IRQn                =  20, /*!< EXTI Line13 interrupt                                                        */
  EXTI14_IRQn                =  21, /*!< EXTI Line14 interrupt                                                        */
  EXTI15_IRQn                =  22, /*!< EXTI Line15 interrupt                                                        */
  LPDMA1_CH0_IRQn            =  23, /*!< LPDMA1 channel0 global interrupt                                             */
  LPDMA1_CH1_IRQn            =  24, /*!< LPDMA1 channel1 global interrupt                                             */
  LPDMA1_CH2_IRQn            =  25, /*!< LPDMA1 channel2 global interrupt                                             */
  LPDMA1_CH3_IRQn            =  26, /*!< LPDMA1 channel3 global interrupt                                             */
  IWDG_IRQn                  =  31, /*!< Independent watchdog interrupt                                               */
  ADC1_IRQn                  =  32, /*!< ADC1 global interrupt                                                        */
  FDCAN1_IT0_IRQn            =  34, /*!< FDCAN1 Interrupt 0                                                           */
  FDCAN1_IT1_IRQn            =  35, /*!< FDCAN1 Interrupt 1                                                           */
  TIM1_BRK_TERR_IERR_IRQn    =  36, /*!< TIM1 Break/TIM1 Transition error/TIM1 Index error                            */
  TIM1_UPD_IRQn              =  37, /*!< TIM1 Update                                                                  */
  TIM1_TRGI_COM_DIR_IDX_IRQn =  38, /*!< TIM1 trigger and commutation/TIM1 Direction Change interrupt/TIM1 Index      */
  TIM1_CC_IRQn               =  39, /*!< TIM1 capture compare interrupt                                               */
  TIM2_IRQn                  =  40, /*!< TIM2 global interrupt                                                        */
  TIM6_IRQn                  =  42, /*!< TIM6 global interrupt                                                        */
  TIM7_IRQn                  =  43, /*!< TIM7 global interrupt                                                        */
  I2C1_EV_IRQn               =  44, /*!< I2C1 event interrupt                                                         */
  I2C1_ERR_IRQn              =  45, /*!< I2C1 error interrupt                                                         */
  I3C1_EV_IRQn               =  46, /*!< I3C1 event interrupt                                                         */
  I3C1_ERR_IRQn              =  47, /*!< I3C1 error interrupt                                                         */
  SPI1_IRQn                  =  48, /*!< SPI1 global interrupt                                                        */
  SPI2_IRQn                  =  49, /*!< SPI2 global interrupt                                                        */
  USART1_IRQn                =  51, /*!< USART1 global interrupt                                                      */
  USART2_IRQn                =  52, /*!< USART2 global interrupt                                                      */
  UART4_IRQn                 =  54, /*!< UART4 global interrupt                                                       */
  UART5_IRQn                 =  55, /*!< UART5 global interrupt                                                       */
  LPUART1_IRQn               =  56, /*!< LPUART1 Rx interrupt OR LPUART1 Tx interrupt                                 */
  LPTIM1_IRQn                =  57, /*!< LPTIM1 global interrupt                                                      */
  TIM12_IRQn                 =  58, /*!< TIM12 global interrupt                                                       */
  TIM15_IRQn                 =  59, /*!< TIM15 global interrupt                                                       */
  USB_DRD_FS_IRQn            =  62, /*!< USB OTG FS global interrupt                                                  */
  CRS_IRQn                   =  63, /*!< Clock Recovery System global interrupt                                       */
  RNG_IRQn                   =  64, /*!< RNG global interrupt                                                         */
  FPU_IRQn                   =  65, /*!< Floating point interrupt                                                     */
  ICACHE_IRQn                =  66, /*!< Instruction cache global interrupt                                           */
  CORDIC_IRQn                =  67, /*!< CORDIC interrupt                                                             */
  AES_IRQn                   =  68, /*!< AES global interrupt                                                         */
  HASH_IRQn                  =  69, /*!< HASH interrupt                                                               */
  TIM8_BRK_TERR_IERR_IRQn    =  72, /*!< TIM8 Break interrupt/TIM8 Transition error/TIM8 Index error                  */
  TIM8_UPD_IRQn              =  73, /*!< TIM8 Update interrupt                                                        */
  TIM8_TRGI_COM_DIR_IDX_IRQn =  74, /*!< TIM8 trigger and commutation interrupt/TIM8 Direction Change interrupt/TIM8
                                         Index                                                                        */
  TIM8_CC_IRQn               =  75, /*!< TIM8 capture compare interrupt                                               */
  COMP1_IRQn                 =  76, /*!< COMP global interrupt                                                        */
  DAC1_IRQn                  =  77, /*!< DAC1 global interrupt                                                        */
  LPDMA2_CH0_IRQn            =  78, /*!< LPDMA2 channel0 global interrupt                                             */
  LPDMA2_CH1_IRQn            =  79, /*!< LPDMA2 channel1 global interrupt                                             */
  LPDMA2_CH2_IRQn            =  80, /*!< LPDMA2 channel2 global interrupt                                             */
  LPDMA2_CH3_IRQn            =  81, /*!< LPDMA2 channel3 global interrupt                                             */
  FDCAN2_IT0_IRQn            =  86, /*!< FDCAN2 Interrupt 0                                                           */
  FDCAN2_IT1_IRQn            =  87, /*!< FDCAN2 Interrupt 1                                                           */
  COMP2_IRQn                 =  88, /*!< COMP2 global interrupt                                                       */
} IRQn_Type;

