MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/**
  * @brief FD Controller Area Network
  */
typedef struct
{
  __IM  uint32_t CREL;         /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IM  uint32_t ENDN;         /*!< FDCAN Endian register,                                           Address offset: 0x004 */
        uint32_t RESERVED1;    /*!< Reserved,                                                                        0x008 */
  __IOM uint32_t DBTP;         /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IOM uint32_t TEST;         /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IOM uint32_t RWD;          /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IOM uint32_t CCCR;         /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IOM uint32_t NBTP;         /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IOM uint32_t TSCC;         /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IOM uint32_t TSCV;         /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IOM uint32_t TOCC;         /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IOM uint32_t TOCV;         /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
        uint32_t RESERVED2[4]; /*!< Reserved,                                                                0x030 - 0x03C */
  __IM  uint32_t ECR;          /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IM  uint32_t PSR;          /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IOM uint32_t TDCR;         /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
        uint32_t RESERVED3;    /*!< Reserved,                                                                        0x04C */
  __IOM uint32_t IR;           /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IOM uint32_t IE;           /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IOM uint32_t ILS;          /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IOM uint32_t ILE;          /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
        uint32_t RESERVED4[8]; /*!< Reserved,                                                                0x060 - 0x07C */
  __IOM uint32_t RXGFC;        /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IOM uint32_t XIDAM;        /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x084 */
  __IM  uint32_t HPMS;         /*!< FDCAN High Priority Message Status register,                     Address offset: 0x088 */
        uint32_t RESERVED5;    /*!< Reserved,                                                                        0x08C */
  __IM  uint32_t RXF0S;        /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x090 */
  __IOM uint32_t RXF0A;        /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x094 */
  __IM  uint32_t RXF1S;        /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x098 */
  __IOM uint32_t RXF1A;        /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x09C */
        uint32_t RESERVED6[8]; /*!< Reserved,                                                                0x0A0 - 0x0BC */
  __IOM uint32_t TXBC;         /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IM  uint32_t TXFQS;        /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IM  uint32_t TXBRP;        /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0C8 */
  __IOM uint32_t TXBAR;        /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0CC */
  __IOM uint32_t TXBCR;        /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D0 */
  __IM  uint32_t TXBTO;        /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D4 */
  __IM  uint32_t TXBCF;        /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0D8 */
  __IOM uint32_t TXBTIE;       /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0DC */
  __IOM uint32_t TXBCIE;       /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E0 */
  __IM  uint32_t TXEFS;        /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0E4 */
  __IOM uint32_t TXEFA;        /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0E8 */
} FDCAN_GlobalTypeDef;

/**
  * @brief FD Controller Area Network Configuration
  */
typedef struct
{
  __IOM uint32_t CKDIV;        /*!< FDCAN clock divider register,                            Address offset: 0x100 + 0x000 */
} FDCAN_Config_TypeDef;

/**
  * @brief FLASH Registers
  */
typedef struct
{
  __IOM uint32_t ACR;             /*!< FLASH access control register,                           Address offset: 0x000 */
  __OM  uint32_t KEYR;            /*!< FLASH key register,                                      Address offset: 0x004 */
        uint32_t RESERVED1;       /*!< Reserved,                                                Address offset: 0x008 */
  __OM  uint32_t OPTKEYR;         /*!< FLASH option key register,                               Address offset: 0x00C */
        uint32_t RESERVED2[2];    /*!< Reserved,                                                Address offset: 0x010 */
  __IM  uint32_t OPSR;            /*!< FLASH operation status register,                         Address offset: 0x018 */
  __IOM uint32_t OPTCR;           /*!< FLASH option control register,                           Address offset: 0x01C */
  __IM  uint32_t SR;              /*!< FLASH status register,                                   Address offset: 0x020 */
        uint32_t RESERVED3;       /*!< Reserved,                                                Address offset: 0x024 */
  __IOM uint32_t CR;              /*!< FLASH control register,                                  Address offset: 0x028 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x02C */
  __OM  uint32_t CCR;             /*!< FLASH clear control register,                            Address offset: 0x030 */
        uint32_t RESERVED5[2];    /*!< Reserved,                                                Address offset: 0x034 */
  __IOM uint32_t PRIVCFGR;        /*!< FLASH privilege configuration register,                  Address offset: 0x03C */
        uint32_t RESERVED6[2];    /*!< Reserved,                                                Address offset: 0x040 */
  __IOM uint32_t HDPEXTR;         /*!< FLASH HDP extension register,                            Address offset: 0x048 */
        uint32_t RESERVED7;       /*!< Reserved,                                                Address offset: 0x04C */
  __IM  uint32_t OPTSR_CUR;       /*!< FLASH option status register,                            Address offset: 0x050 */
  __IOM uint32_t OPTSR_PRG;       /*!< FLASH option status register,                            Address offset: 0x054 */
        uint32_t RESERVED8[6];    /*!< Reserved,                                                Address offset: 0x058 */
  __IM  uint32_t OPTSR2_CUR;      /*!< FLASH option status register 2,                          Address offset: 0x070 */
  __IOM uint32_t OPTSR2_PRG;      /*!< FLASH option status register 2,                          Address offset: 0x074 */
        uint32_t RESERVED9[2];    /*!< Reserved,                                                Address offset: 0x078 */
  __IM  uint32_t BOOTR_CUR;       /*!< FLASH unique boot entry register,                        Address offset: 0x080 */
  __IOM uint32_t BOOTR_PRG;       /*!< FLASH unique boot entry address,                         Address offset: 0x084 */
        uint32_t RESERVED10[2];   /*!< Reserved,                                                Address offset: 0x088 */
  __IM  uint32_t OTPBLR_CUR;      /*!< FLASH OTP block lock,                                    Address offset: 0x090 */
  __IOM uint32_t OTPBLR_PRG;      /*!< FLASH OTP block lock,                                    Address offset: 0x094 */
  __IM  uint32_t BL_COM_CFG_CUR;  /*!< FLASH Bootloader interface selection,                    Address offset: 0x098 */
  __IOM uint32_t BL_COM_CFG_PRG;  /*!< FLASH Bootloader interface selection,                    Address offset: 0x09C */
        uint32_t RESERVED11;      /*!< Reserved,                                                Address offset: 0x0A0 */
  __OM  uint32_t OEMKEYR1_PRG;    /*!< FLASH OEM Key register 1,                                Address offset: 0x0A4 */
        uint32_t RESERVED12;      /*!< Reserved,                                                Address offset: 0x0A8 */
  __OM  uint32_t OEMKEYR2_PRG;    /*!< FLASH OEM Key register 2,                                Address offset: 0x0AC */
        uint32_t RESERVED13;      /*!< Reserved,                                                Address offset: 0x0B0 */
  __OM  uint32_t OEMKEYR3_PRG;    /*!< FLASH OEM Key register 3,                                Address offset: 0x0B4 */
        uint32_t RESERVED14;      /*!< Reserved,                                                Address offset: 0x0B8 */
  __OM  uint32_t OEMKEYR4_PRG;    /*!< FLASH OEM Key register 4,                                Address offset: 0x0BC */
        uint32_t RESERVED15;      /*!< Reserved,                                                Address offset: 0x0C0 */
  __OM  uint32_t BSKEYR_PRG;      /*!< FLASH Boundary Scan key register,                        Address offset: 0x0C4 */
        uint32_t RESERVED16[8];   /*!< Reserved,                                                Address offset: 0x0C8 */
  __IM  uint32_t WRP1R_CUR;       /*!< FLASH write page protection for bank1,                   Address offset: 0x0E8 */
  __IOM uint32_t WRP1R_PRG;       /*!< FLASH write page protection for bank1,                   Address offset: 0x0EC */
        uint32_t RESERVED17[2];   /*!< Reserved,                                                Address offset: 0x0F0 */
  __IM  uint32_t HDP1R_CUR;       /*!< FLASH HDP bank1 register,                                Address offset: 0x0F8 */
  __IOM uint32_t HDP1R_PRG;       /*!< FLASH HDP bank1 register,                                Address offset: 0x0FC */
  __IOM uint32_t ECCCORR;         /*!< FLASH ECC correction register,                           Address offset: 0x100 */
  __IOM uint32_t ECCDETR;         /*!< FLASH ECC detection register,                            Address offset: 0x104 */
  __IM  uint32_t ECCDR;           /*!< FLASH ECC data,                                          Address offset: 0x108 */
        uint32_t RESERVED18[55];  /*!< Reserved,                                                Address offset: 0x10C */
  __IM  uint32_t WRP2R_CUR;       /*!< FLASH write page protection for bank2,                   Address offset: 0x1E8 */
  __IOM uint32_t WRP2R_PRG;       /*!< FLASH write page protection for bank2,                   Address offset: 0x1EC */
        uint32_t RESERVED19[2];   /*!< Reserved,                                                Address offset: 0x1F0 */
  __IM  uint32_t HDP2R_CUR;       /*!< FLASH HDP bank2 register,                                Address offset: 0x1F8 */
  __IOM uint32_t HDP2R_PRG;       /*!< FLASH HDP bank2 register,                                Address offset: 0x1FC */
} FLASH_TypeDef;

/**
  * @brief General Purpose I/O (GPIO)
  */
typedef struct
{
  __IOM uint32_t MODER;           /*!< GPIO port mode register,                                 Address offset: 0x000 */
  __IOM uint32_t OTYPER;          /*!< GPIO port output type register,                          Address offset: 0x004 */
  __IOM uint32_t OSPEEDR;         /*!< GPIO port output speed register,                         Address offset: 0x008 */
  __IOM uint32_t PUPDR;           /*!< GPIO port pull-up/pull-down register,                    Address offset: 0x00C */
  __IM  uint32_t IDR;             /*!< GPIO port input data register,                           Address offset: 0x010 */
  __IOM uint32_t ODR;             /*!< GPIO port output data register,                          Address offset: 0x014 */
  __OM  uint32_t BSRR;            /*!< GPIO port bit set/reset register,                        Address offset: 0x018 */
  __IOM uint32_t LCKR;            /*!< GPIO port configuration lock register,                   Address offset: 0x01C */
  __IOM uint32_t AFR[2];          /*!< GPIO alternate function register,                        Address offset: 0x020 */
  __OM  uint32_t BRR;             /*!< GPIO port bit reset register,                            Address offset: 0x028 */
} GPIO_TypeDef;

/**
  * @brief Hash processor (HASH)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< HASH control register,                                   Address offset: 0x000 */
  __OM  uint32_t DIN;             /*!< HASH data input register,                                Address offset: 0x004 */
  __IOM uint32_t STR;             /*!< HASH start register,                                     Address offset: 0x008 */
  __IM  uint32_t HRA[5];          /*!< HASH digest registers,                                   Address offset: 0x00C */
  __IOM uint32_t IMR;             /*!< HASH interrupt enable register,                          Address offset: 0x020 */
  __IOM uint32_t SR;              /*!< HASH status register,                                    Address offset: 0x024 */
        uint32_t RESERVED1[52];   /*!< Reserved,                                                Address offset: 0x028 */
  __IOM uint32_t CSR[54];         /*!< HASH context swap register,                              Address offset: 0x0F8 */
        uint32_t RESERVED2[80];   /*!< Reserved,                                                Address offset: 0x1D0 */
  __IM  uint32_t HR[8];           /*!< HASH digest register,                                    Address offset: 0x310 */
} HASH_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface
  */
typedef struct
{
  __IOM uint32_t CR1;         /*!< I2C Control register 1,            Address offset: 0x00 */
  __IOM uint32_t CR2;         /*!< I2C Control register 2,            Address offset: 0x04 */
  __IOM uint32_t OAR1;        /*!< I2C Own address 1 register,        Address offset: 0x08 */
  __IOM uint32_t OAR2;        /*!< I2C Own address 2 register,        Address offset: 0x0C */
  __IOM uint32_t TIMINGR;     /*!< I2C Timing register,               Address offset: 0x10 */
  __IOM uint32_t TIMEOUTR;    /*!< I2C Timeout register,              Address offset: 0x14 */
  __IOM uint32_t ISR;         /*!< I2C Interrupt and status register, Address offset: 0x18 */
  __OM  uint32_t ICR;         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
  __IM  uint32_t PECR;        /*!< I2C PEC register,                  Address offset: 0x20 */
  __IM  uint32_t RXDR;        /*!< I2C Receive data register,         Address offset: 0x24 */
  __IOM uint32_t TXDR;        /*!< I2C Transmit data register,        Address offset: 0x28 */
} I2C_TypeDef;

/**
  * @brief Improved Inter-integrated Circuit Interface
  */
typedef struct
{
  __OM  uint32_t CR;             /*!< I3C Control register,                      Address offset: 0x00      */
  __IOM uint32_t CFGR;           /*!< I3C Controller Configuration register,     Address offset: 0x04      */
        uint32_t RESERVED1[2];   /*!< Reserved,                                  Address offset: 0x08-0x0C */
  __IM  uint32_t RDR;            /*!< I3C Received Data register,                Address offset: 0x10      */
  __IM  uint32_t RDWR;           /*!< I3C Received Data Word register,           Address offset: 0x14      */
  __OM  uint32_t TDR;            /*!< I3C Transmit Data register,                Address offset: 0x18      */
  __OM  uint32_t TDWR;           /*!< I3C Transmit Data Word register,           Address offset: 0x1C      */
  __IOM uint32_t IBIDR;          /*!< I3C IBI payload Data register,             Address offset: 0x20      */
  __IOM uint32_t TGTTDR;         /*!< I3C Target Transmit register,              Address offset: 0x24      */
        uint32_t RESERVED2[2];   /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IM  uint32_t SR;             /*!< I3C Status register,                       Address offset: 0x30      */
  __IM  uint32_t SER;            /*!< I3C Status Error register,                 Address offset: 0x34      */
        uint32_t RESERVED3[2];   /*!< Reserved,                                  Address offset: 0x38-0x3C */
  __IM  uint32_t RMR;            /*!< I3C Received Message register,             Address offset: 0x40      */
        uint32_t RESERVED4[3];   /*!< Reserved,                                  Address offset: 0x44-0x4C */
  __IM  uint32_t EVR;            /*!< I3C Event register,                        Address offset: 0x50      */
  __IOM uint32_t IER;            /*!< I3C Interrupt Enable register,             Address offset: 0x54      */
  __OM  uint32_t CEVR;           /*!< I3C Clear Event register,                  Address offset: 0x58      */
  __IM  uint32_t MISR;           /*!< I3C Masked Interrupt Status register,      Address offset: 0x5C      */
  __IOM uint32_t DEVR0;          /*!< I3C own Target characteristics register,   Address offset: 0x60      */
  __IOM uint32_t DEVRX[4];       /*!< I3C Target x (1<=x<=4) register,           Address offset: 0x64-0x70 */
        uint32_t RESERVED5[7];   /*!< Reserved,                                  Address offset: 0x74-0x8C */
  __IOM uint32_t MAXRLR;         /*!< I3C Maximum Read Length register,          Address offset: 0x90      */
  __IOM uint32_t MAXWLR;         /*!< I3C Maximum Write Length register,         Address offset: 0x94      */
        uint32_t RESERVED6[2];   /*!< Reserved,                                  Address offset: 0x98-0x9C */
  __IOM uint32_t TIMINGR0;       /*!< I3C Timing 0 register,                     Address offset: 0xA0      */
  __IOM uint32_t TIMINGR1;       /*!< I3C Timing 1 register,                     Address offset: 0xA4      */
  __IOM uint32_t TIMINGR2;       /*!< I3C Timing 2 register,                     Address offset: 0xA8      */
        uint32_t RESERVED7[5];   /*!< Reserved,                                  Address offset: 0xAC-0xBC */
  __IOM uint32_t BCR;            /*!< I3C Bus Characteristics register,          Address offset: 0xC0      */
  __IOM uint32_t DCR;            /*!< I3C Device Characteristics register,       Address offset: 0xC4      */
  __IOM uint32_t GETCAPR;        /*!< I3C GET CAPabilities register,             Address offset: 0xC8      */
  __IOM uint32_t CRCAPR;         /*!< I3C Controller CAPabilities register,      Address offset: 0xCC      */
  __IOM uint32_t GETMXDSR;       /*!< I3C GET Max Data Speed register,           Address offset: 0xD0      */
  __IOM uint32_t EPIDR;          /*!< I3C Extended Provisioned ID register,      Address offset: 0xD4      */
} I3C_TypeDef;

/**
  * @brief Instruction cache (ICACHE)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< ICACHE control register,                                 Address offset: 0x000 */
  __IM  uint32_t SR;              /*!< ICACHE status register,                                  Address offset: 0x004 */
  __IOM uint32_t IER;             /*!< ICACHE interrupt enable register,                        Address offset: 0x008 */
  __OM  uint32_t FCR;             /*!< ICACHE flag clear register,                              Address offset: 0x00C */
  __IM  uint32_t HMONR;           /*!< ICACHE hit monitor register,                             Address offset: 0x010 */
  __IM  uint32_t MMONR;           /*!< ICACHE miss monitor register,                            Address offset: 0x014 */
        uint32_t RESERVED1[2];    /*!< Reserved,                                                Address offset: 0x018 */
  __IOM uint32_t CRR0;            /*!< ICACHE region 0 configuration register,                  Address offset: 0x020 */
  __IOM uint32_t CRR1;            /*!< ICACHE region 1 configuration register,                  Address offset: 0x024 */
  __IOM uint32_t CRR2;            /*!< ICACHE region 2 configuration register,                  Address offset: 0x028 */
  __IOM uint32_t CRR3;            /*!< ICACHE region 3 configuration register,                  Address offset: 0x02C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
__OM  uint32_t KR;               /*!< IWDG Key register,             Address offset: 0x00 */
__IOM uint32_t PR;               /*!< IWDG Prescaler register,       Address offset: 0x04 */
__IOM uint32_t RLR;              /*!< IWDG Reload register,          Address offset: 0x08 */
__IM  uint32_t SR;               /*!< IWDG Status register,          Address offset: 0x0C */
__IOM uint32_t WINR;             /*!< IWDG Window register,          Address offset: 0x10 */
__IOM uint32_t EWCR;             /*!< IWDG Early Wakeup register,    Address offset: 0x14 */
__IOM uint32_t ICR;              /*!< IWDG interrupt clear register, Address offset: 0x18 */
} IWDG_TypeDef;

/**
  * @brief LPTIMER
  */
typedef struct
{
__IM  uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
__OM  uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
__IOM uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
__IOM uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
__IOM uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
__IOM uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
__IOM uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
__IM  uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
      uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x20 */
__IOM uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
__IOM uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
__IOM uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
      uint32_t RESERVED2;        /*!< Reserved,                               Address offset: 0x30 */
__IOM uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;

