MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* ************************************  Bit definition for ADCC_CDR2 register  ************************************* */
#define ADCC_CDR2_RDATA_ALT_Pos (0U)
#define ADCC_CDR2_RDATA_ALT_Msk (0xFFFFFFFFUL << ADCC_CDR2_RDATA_ALT_Pos) /*!< 0xFFFFFFFF */
#define ADCC_CDR2_RDATA_ALT     ADCC_CDR2_RDATA_ALT_Msk         /*!< Regular data of the master/slave alternated ADCs */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                           AES hardware accelerator (AES)                                           */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* **************************************  Bit definition for AES_CR register  ************************************** */
#define AES_CR_EN_Pos             (0U)
#define AES_CR_EN_Msk             (0x1UL << AES_CR_EN_Pos)                     /*!< 0x00000001 */
#define AES_CR_EN                 AES_CR_EN_Msk                                /*!< Enable */
#define AES_CR_DATATYPE_Pos       (1U)
#define AES_CR_DATATYPE_Msk       (0x3UL << AES_CR_DATATYPE_Pos)               /*!< 0x00000006 */
#define AES_CR_DATATYPE           AES_CR_DATATYPE_Msk                          /*!< Data type */
#define AES_CR_DATATYPE_0         (0x1UL << AES_CR_DATATYPE_Pos)               /*!< 0x00000002 */
#define AES_CR_DATATYPE_1         (0x2UL << AES_CR_DATATYPE_Pos)               /*!< 0x00000004 */
#define AES_CR_MODE_Pos           (3U)
#define AES_CR_MODE_Msk           (0x3UL << AES_CR_MODE_Pos)                   /*!< 0x00000018 */
#define AES_CR_MODE               AES_CR_MODE_Msk                              /*!< Operating mode */
#define AES_CR_MODE_0             (0x1UL << AES_CR_MODE_Pos)                   /*!< 0x00000008 */
#define AES_CR_MODE_1             (0x2UL << AES_CR_MODE_Pos)                   /*!< 0x00000010 */
#define AES_CR_CHMOD_Pos          (5U)
#define AES_CR_CHMOD_Msk          (0x803UL << AES_CR_CHMOD_Pos)                /*!< 0x00010060 */
#define AES_CR_CHMOD              AES_CR_CHMOD_Msk                             /*!< AES Chaining Mode */
#define AES_CR_CHMOD_0            (0x001UL << AES_CR_CHMOD_Pos)                /*!< 0x00000020 */
#define AES_CR_CHMOD_1            (0x002UL << AES_CR_CHMOD_Pos)                /*!< 0x00000040 */
#define AES_CR_CHMOD_2            (0x800UL << AES_CR_CHMOD_Pos)                /*!< 0x00010000 */
#define AES_CR_DMAINEN_Pos        (11U)
#define AES_CR_DMAINEN_Msk        (0x1UL << AES_CR_DMAINEN_Pos)                /*!< 0x00000800 */
#define AES_CR_DMAINEN            AES_CR_DMAINEN_Msk                           /*!< DMA input enable */
#define AES_CR_DMAOUTEN_Pos       (12U)
#define AES_CR_DMAOUTEN_Msk       (0x1UL << AES_CR_DMAOUTEN_Pos)               /*!< 0x00001000 */
#define AES_CR_DMAOUTEN           AES_CR_DMAOUTEN_Msk                          /*!< DMA output enable */
#define AES_CR_CPHASE_Pos         (13U)
#define AES_CR_CPHASE_Msk         (0x3UL << AES_CR_CPHASE_Pos)                 /*!< 0x00006000 */
#define AES_CR_CPHASE             AES_CR_CPHASE_Msk                            /*!< Chaining phase selection */
#define AES_CR_CPHASE_0           (0x1UL << AES_CR_CPHASE_Pos)                 /*!< 0x00002000 */
#define AES_CR_CPHASE_1           (0x2UL << AES_CR_CPHASE_Pos)                 /*!< 0x00004000 */
#define AES_CR_KEYSIZE_Pos        (18U)
#define AES_CR_KEYSIZE_Msk        (0x1UL << AES_CR_KEYSIZE_Pos)                /*!< 0x00040000 */
#define AES_CR_KEYSIZE            AES_CR_KEYSIZE_Msk                           /*!< Key size selection */
#define AES_CR_NPBLB_Pos          (20U)
#define AES_CR_NPBLB_Msk          (0xFUL << AES_CR_NPBLB_Pos)                  /*!< 0x00F00000 */
#define AES_CR_NPBLB              AES_CR_NPBLB_Msk                             /*!< Number of padding bytes in last
                                                                                    block */
#define AES_CR_NPBLB_0            (0x1UL << AES_CR_NPBLB_Pos)                  /*!< 0x00100000 */
#define AES_CR_NPBLB_1            (0x2UL << AES_CR_NPBLB_Pos)                  /*!< 0x00200000 */
#define AES_CR_NPBLB_2            (0x4UL << AES_CR_NPBLB_Pos)                  /*!< 0x00400000 */
#define AES_CR_NPBLB_3            (0x8UL << AES_CR_NPBLB_Pos)                  /*!< 0x00800000 */
#define AES_CR_KMOD_Pos           (24U)
#define AES_CR_KMOD_Msk           (0x3UL << AES_CR_KMOD_Pos)                   /*!< 0x03000000 */
#define AES_CR_KMOD               AES_CR_KMOD_Msk                              /*!< Key mode selection */
#define AES_CR_KMOD_0             (0x1UL << AES_CR_KMOD_Pos)                   /*!< 0x01000000 */
#define AES_CR_KMOD_1             (0x2UL << AES_CR_KMOD_Pos)                   /*!< 0x02000000 */
#define AES_CR_IPRST_Pos          (31U)
#define AES_CR_IPRST_Msk          (0x1UL << AES_CR_IPRST_Pos)                  /*!< 0x80000000 */
#define AES_CR_IPRST              AES_CR_IPRST_Msk                             /*!< AES peripheral software reset */

/* **************************************  Bit definition for AES_SR register  ************************************** */
#define AES_SR_RDERRF_Pos         (1U)
#define AES_SR_RDERRF_Msk         (0x1UL << AES_SR_RDERRF_Pos)                 /*!< 0x00000002 */
#define AES_SR_RDERRF             AES_SR_RDERRF_Msk                            /*!< Read error flag */
#define AES_SR_WRERRF_Pos         (2U)
#define AES_SR_WRERRF_Msk         (0x1UL << AES_SR_WRERRF_Pos)                 /*!< 0x00000004 */
#define AES_SR_WRERRF             AES_SR_WRERRF_Msk                            /*!< Write error flag */
#define AES_SR_BUSY_Pos           (3U)
#define AES_SR_BUSY_Msk           (0x1UL << AES_SR_BUSY_Pos)                   /*!< 0x00000008 */
#define AES_SR_BUSY               AES_SR_BUSY_Msk                              /*!< Busy Flag */
#define AES_SR_KEYVALID_Pos       (7U)
#define AES_SR_KEYVALID_Msk       (0x1UL << AES_SR_KEYVALID_Pos)               /*!< 0x00000080 */
#define AES_SR_KEYVALID           AES_SR_KEYVALID_Msk                          /*!< Key valid flag */

