MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* *************************************  Bit definition for AES_DINR register  ************************************* */
#define AES_DINR_DIN_Pos          (0U)
#define AES_DINR_DIN_Msk          (0xFFFFFFFFUL << AES_DINR_DIN_Pos)           /*!< 0xFFFFFFFF */
#define AES_DINR_DIN              AES_DINR_DIN_Msk                             /*!< Data input */

/* ************************************  Bit definition for AES_DOUTR register  ************************************* */
#define AES_DOUTR_DOUT_Pos        (0U)
#define AES_DOUTR_DOUT_Msk        (0xFFFFFFFFUL << AES_DOUTR_DOUT_Pos)         /*!< 0xFFFFFFFF */
#define AES_DOUTR_DOUT            AES_DOUTR_DOUT_Msk                           /*!< Data output */

/* ************************************  Bit definition for AES_KEYR0 register  ************************************* */
#define AES_KEYR0_KEY_Pos         (0U)
#define AES_KEYR0_KEY_Msk         (0xFFFFFFFFUL <<  AES_KEYR0_KEY_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR0_KEY             AES_KEYR0_KEY_Msk                            /*!< Cryptographic key, bits [31:0] */

/* ************************************  Bit definition for AES_KEYR1 register  ************************************* */
#define AES_KEYR1_KEY_Pos         (0U)
#define AES_KEYR1_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR1_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR1_KEY             AES_KEYR1_KEY_Msk                            /*!< Cryptographic key, bits [63:32] */

/* ************************************  Bit definition for AES_KEYR2 register  ************************************* */
#define AES_KEYR2_KEY_Pos         (0U)
#define AES_KEYR2_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR2_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR2_KEY             AES_KEYR2_KEY_Msk                            /*!< Cryptographic key, bits [95:64] */

/* ************************************  Bit definition for AES_KEYR3 register  ************************************* */
#define AES_KEYR3_KEY_Pos         (0U)
#define AES_KEYR3_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR3_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR3_KEY             AES_KEYR3_KEY_Msk                            /*!< Cryptographic key, bits [127:96] */

/* ************************************  Bit definition for AES_KEYR4 register  ************************************* */
#define AES_KEYR4_KEY_Pos         (0U)
#define AES_KEYR4_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR4_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR4_KEY             AES_KEYR4_KEY_Msk                            /*!< Cryptographic key, bits [159:128] */

/* ************************************  Bit definition for AES_KEYR5 register  ************************************* */
#define AES_KEYR5_KEY_Pos         (0U)
#define AES_KEYR5_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR5_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR5_KEY             AES_KEYR5_KEY_Msk                            /*!< Cryptographic key, bits [191:160] */

/* ************************************  Bit definition for AES_KEYR6 register  ************************************* */
#define AES_KEYR6_KEY_Pos         (0U)
#define AES_KEYR6_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR6_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR6_KEY             AES_KEYR6_KEY_Msk                            /*!< Cryptographic key, bits [223:192] */

/* ************************************  Bit definition for AES_KEYR7 register  ************************************* */
#define AES_KEYR7_KEY_Pos         (0U)
#define AES_KEYR7_KEY_Msk         (0xFFFFFFFFUL << AES_KEYR7_KEY_Pos)          /*!< 0xFFFFFFFF */
#define AES_KEYR7_KEY             AES_KEYR7_KEY_Msk                            /*!< Cryptographic key, bits [255:224] */

/* *************************************  Bit definition for AES_IVR0 register  ************************************* */
#define AES_IVR0_IVI_Pos          (0U)
#define AES_IVR0_IVI_Msk          (0xFFFFFFFFUL << AES_IVR0_IVI_Pos)           /*!< 0xFFFFFFFF */
#define AES_IVR0_IVI              AES_IVR0_IVI_Msk                             /*!< Initialization vector input, bits
                                                                                    [31:0] */

/* *************************************  Bit definition for AES_IVR1 register  ************************************* */
#define AES_IVR1_IVI_Pos          (0U)
#define AES_IVR1_IVI_Msk          (0xFFFFFFFFUL << AES_IVR1_IVI_Pos)           /*!< 0xFFFFFFFF */
#define AES_IVR1_IVI              AES_IVR1_IVI_Msk                             /*!< Initialization vector input, bits
                                                                                    [63:32] */

/* *************************************  Bit definition for AES_IVR2 register  ************************************* */
#define AES_IVR2_IVI_Pos          (0U)
#define AES_IVR2_IVI_Msk          (0xFFFFFFFFUL << AES_IVR2_IVI_Pos)           /*!< 0xFFFFFFFF */
#define AES_IVR2_IVI              AES_IVR2_IVI_Msk                             /*!< Initialization vector input, bits
                                                                                    [95:64] */

/* *************************************  Bit definition for AES_IVR3 register  ************************************* */
#define AES_IVR3_IVI_Pos          (0U)
#define AES_IVR3_IVI_Msk          (0xFFFFFFFFUL << AES_IVR3_IVI_Pos)           /*!< 0xFFFFFFFF */
#define AES_IVR3_IVI              AES_IVR3_IVI_Msk                             /*!< Initialization vector input, bits
                                                                                    [127:96] */

/* ************************************  Bit definition for AES_SUSPR0 register  ************************************ */
#define AES_SUSPR0_SUSP_Pos       (0U)
#define AES_SUSPR0_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR0_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR0_SUSP           AES_SUSPR0_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR1 register  ************************************ */
#define AES_SUSPR1_SUSP_Pos       (0U)
#define AES_SUSPR1_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR1_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR1_SUSP           AES_SUSPR1_SUSP_Msk                          /*!< Suspend data */

