MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
#define COMP_CFGR1_SCALEN_Pos               (2U)
#define COMP_CFGR1_SCALEN_Msk               (0x1UL << COMP_CFGR1_SCALEN_Pos)      /*!< 0x00000004 */
#define COMP_CFGR1_SCALEN                   COMP_CFGR1_SCALEN_Msk                 /*!< Comparator voltage scaler enable */

#define COMP_CFGR1_POLARITY_Pos             (3U)
#define COMP_CFGR1_POLARITY_Msk             (0x1UL << COMP_CFGR1_POLARITY_Pos)    /*!< 0x00000008 */
#define COMP_CFGR1_POLARITY                 COMP_CFGR1_POLARITY_Msk               /*!< Comparator polarity selection */

#define COMP_CFGR1_WINMODE_Pos              (4U)
#define COMP_CFGR1_WINMODE_Msk              (0x1UL << COMP_CFGR1_WINMODE_Pos)     /*!< 0x00000010 */
#define COMP_CFGR1_WINMODE                  COMP_CFGR1_WINMODE_Msk                /*!< Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef) */

#define COMP_CFGR1_ITEN_Pos                 (6U)
#define COMP_CFGR1_ITEN_Msk                 (0x1UL << COMP_CFGR1_ITEN_Pos)        /*!< 0x00000040 */
#define COMP_CFGR1_ITEN                     COMP_CFGR1_ITEN_Msk                   /*!< Comparator interrupt enable */

#define COMP_CFGR1_HYST_Pos                 (8U)
#define COMP_CFGR1_HYST_Msk                 (0x3UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000300 */
#define COMP_CFGR1_HYST                     COMP_CFGR1_HYST_Msk                   /*!< Comparator hysteresis selection */
#define COMP_CFGR1_HYST_0                   (0x1UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000100 */
#define COMP_CFGR1_HYST_1                   (0x2UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000200 */

#define COMP_CFGR1_PWRMODE_Pos              (12U)
#define COMP_CFGR1_PWRMODE_Msk              (0x3UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00003000 */
#define COMP_CFGR1_PWRMODE                  COMP_CFGR1_PWRMODE_Msk                /*!< Comparator power mode selection */
#define COMP_CFGR1_PWRMODE_0                (0x1UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00001000 */
#define COMP_CFGR1_PWRMODE_1                (0x2UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00002000 */

#define COMP_CFGR1_WINOUT_Pos               (14U)
#define COMP_CFGR1_WINOUT_Msk               (0x1UL << COMP_CFGR1_WINOUT_Pos)      /*!< 0x00004000 */
#define COMP_CFGR1_WINOUT                   COMP_CFGR1_WINOUT_Msk                 /*!< Pair of comparators window output level. Bit intended to be used with COMP common instance (COMP_Common_TypeDef) */

#define COMP_CFGR1_INMSEL_Pos               (16U)
#define COMP_CFGR1_INMSEL_Msk               (0xFUL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x000F0000 */
#define COMP_CFGR1_INMSEL                   COMP_CFGR1_INMSEL_Msk                 /*!< Comparator input minus selection */
#define COMP_CFGR1_INMSEL_0                 (0x1UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00010000 */
#define COMP_CFGR1_INMSEL_1                 (0x2UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00020000 */
#define COMP_CFGR1_INMSEL_2                 (0x4UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00040000 */
#define COMP_CFGR1_INMSEL_3                 (0x8UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00080000 */

#define COMP_CFGR1_INPSEL_Pos               (20U)
#define COMP_CFGR1_INPSEL_Msk               (0x5UL << COMP_CFGR1_INPSEL_Pos)      /*!< 0x00500000 */
#define COMP_CFGR1_INPSEL                   COMP_CFGR1_INPSEL_Msk                 /*!< Comparator input plus selection */
#define COMP_CFGR1_INPSEL_0                 (0x1UL << COMP_CFGR1_INPSEL_Pos)      /*!< 0x00100000 */
#define COMP_CFGR1_INPSEL_1                 (0x4UL << COMP_CFGR1_INPSEL_Pos)      /*!< 0x00400000 */

#define COMP_CFGR1_BLANKING_Pos             (24U)
#define COMP_CFGR1_BLANKING_Msk             (0xFUL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x0F000000 */
#define COMP_CFGR1_BLANKING                 COMP_CFGR1_BLANKING_Msk               /*!< Comparator blanking source selection */
#define COMP_CFGR1_BLANKING_0               (0x1UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x01000000 */
#define COMP_CFGR1_BLANKING_1               (0x2UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x02000000 */
#define COMP_CFGR1_BLANKING_2               (0x4UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x04000000 */
#define COMP_CFGR1_BLANKING_3               (0x8UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x08000000 */

#define COMP_CFGR1_LOCK_Pos                 (31U)
#define COMP_CFGR1_LOCK_Msk                 (0x1UL << COMP_CFGR1_LOCK_Pos)        /*!< 0x80000000 */
#define COMP_CFGR1_LOCK                     COMP_CFGR1_LOCK_Msk                   /*!< Comparator lock */

/********************  Bit definition for COMP_CFGR2 register  ******************/
#define COMP_CFGR2_EN_Pos                   (0U)
#define COMP_CFGR2_EN_Msk                   (0x1UL << COMP_CFGR2_EN_Pos)          /*!< 0x00000001 */
#define COMP_CFGR2_EN                       COMP_CFGR2_EN_Msk                     /*!< Comparator enable */

#define COMP_CFGR2_BRGEN_Pos                (1U)
#define COMP_CFGR2_BRGEN_Msk                (0x1UL << COMP_CFGR2_BRGEN_Pos)       /*!< 0x00000002 */
#define COMP_CFGR2_BRGEN                    COMP_CFGR2_BRGEN_Msk                  /*!< Comparator scaler bridge enable */

#define COMP_CFGR2_SCALEN_Pos               (2U)
#define COMP_CFGR2_SCALEN_Msk               (0x1UL << COMP_CFGR2_SCALEN_Pos)      /*!< 0x00000004 */
#define COMP_CFGR2_SCALEN                   COMP_CFGR2_SCALEN_Msk                 /*!< Comparator voltage scaler enable */

#define COMP_CFGR2_POLARITY_Pos             (3U)
#define COMP_CFGR2_POLARITY_Msk             (0x1UL << COMP_CFGR2_POLARITY_Pos)    /*!< 0x00000008 */
#define COMP_CFGR2_POLARITY                 COMP_CFGR2_POLARITY_Msk               /*!< Comparator polarity selection */

#define COMP_CFGR2_WINMODE_Pos              (4U)
#define COMP_CFGR2_WINMODE_Msk              (0x1UL << COMP_CFGR2_WINMODE_Pos)     /*!< 0x00000010 */
#define COMP_CFGR2_WINMODE                  COMP_CFGR2_WINMODE_Msk                /*!< Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef) */

#define COMP_CFGR2_ITEN_Pos                 (6U)
#define COMP_CFGR2_ITEN_Msk                 (0x1UL << COMP_CFGR2_ITEN_Pos)        /*!< 0x00000040 */
#define COMP_CFGR2_ITEN                     COMP_CFGR2_ITEN_Msk                   /*!< Comparator interrupt enable */

#define COMP_CFGR2_HYST_Pos                 (8U)
#define COMP_CFGR2_HYST_Msk                 (0x3UL << COMP_CFGR2_HYST_Pos)        /*!< 0x00000300 */
#define COMP_CFGR2_HYST                     COMP_CFGR2_HYST_Msk                   /*!< Comparator hysteresis selection */
#define COMP_CFGR2_HYST_0                   (0x1UL << COMP_CFGR2_HYST_Pos)        /*!< 0x00000100 */
#define COMP_CFGR2_HYST_1                   (0x2UL << COMP_CFGR2_HYST_Pos)        /*!< 0x00000200 */

#define COMP_CFGR2_PWRMODE_Pos              (12U)
#define COMP_CFGR2_PWRMODE_Msk              (0x3UL << COMP_CFGR2_PWRMODE_Pos)     /*!< 0x00003000 */
#define COMP_CFGR2_PWRMODE                  COMP_CFGR2_PWRMODE_Msk                /*!< Comparator power mode selection */
#define COMP_CFGR2_PWRMODE_0                (0x1UL << COMP_CFGR2_PWRMODE_Pos)     /*!< 0x00001000 */
#define COMP_CFGR2_PWRMODE_1                (0x2UL << COMP_CFGR2_PWRMODE_Pos)     /*!< 0x00002000 */

