MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* ************************************  Bit definition for DAC_SHSR1 register  ************************************* */
#define DAC_SHSR1_TSAMPLE1_Pos     (0U)
#define DAC_SHSR1_TSAMPLE1_Msk     (0x3FFUL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x000003FF */
#define DAC_SHSR1_TSAMPLE1         DAC_SHSR1_TSAMPLE1_Msk                  /*!< DAC channel1 sample time
                                                                                (only valid in sample and hold mode) */
#define DAC_SHSR1_TSAMPLE1_0       (0x1UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000001 */
#define DAC_SHSR1_TSAMPLE1_1       (0x2UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000002 */
#define DAC_SHSR1_TSAMPLE1_2       (0x4UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000004 */
#define DAC_SHSR1_TSAMPLE1_3       (0x8UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000008 */
#define DAC_SHSR1_TSAMPLE1_4       (0x10UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000010 */
#define DAC_SHSR1_TSAMPLE1_5       (0x20UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000020 */
#define DAC_SHSR1_TSAMPLE1_6       (0x40UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000040 */
#define DAC_SHSR1_TSAMPLE1_7       (0x80UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000080 */
#define DAC_SHSR1_TSAMPLE1_8       (0x100UL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x00000100 */
#define DAC_SHSR1_TSAMPLE1_9       (0x200UL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x00000200 */

/* ************************************  Bit definition for DAC_SHSR2 register  ************************************* */
#define DAC_SHSR2_TSAMPLE2_Pos     (0U)
#define DAC_SHSR2_TSAMPLE2_Msk     (0x3FFUL << DAC_SHSR2_TSAMPLE2_Pos)     /*!< 0x000003FF */
#define DAC_SHSR2_TSAMPLE2         DAC_SHSR2_TSAMPLE2_Msk                  /*!< DAC channel2 sample time
                                                                                (only valid in sample and hold mode) */

/* *************************************  Bit definition for DAC_SHHR register  ************************************* */
#define DAC_SHHR_THOLD1_Pos        (0U)
#define DAC_SHHR_THOLD1_Msk        (0x3FFUL << DAC_SHHR_THOLD1_Pos)        /*!< 0x000003FF */
#define DAC_SHHR_THOLD1            DAC_SHHR_THOLD1_Msk                     /*!< DAC channel1 hold time
                                                                                (only valid in Sample and hold mode) */
#define DAC_SHHR_THOLD1_0          (0x1UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000001 */
#define DAC_SHHR_THOLD1_1          (0x2UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000002 */
#define DAC_SHHR_THOLD1_2          (0x4UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000004 */
#define DAC_SHHR_THOLD1_3          (0x8UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000008 */
#define DAC_SHHR_THOLD1_4          (0x10UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000010 */
#define DAC_SHHR_THOLD1_5          (0x20UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000020 */
#define DAC_SHHR_THOLD1_6          (0x40UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000040 */
#define DAC_SHHR_THOLD1_7          (0x080UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000080 */
#define DAC_SHHR_THOLD1_8          (0x100UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000100 */
#define DAC_SHHR_THOLD1_9          (0x200UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000200 */
#define DAC_SHHR_THOLD2_Pos        (16U)
#define DAC_SHHR_THOLD2_Msk        (0x3FFUL << DAC_SHHR_THOLD2_Pos)        /*!< 0x03FF0000 */
#define DAC_SHHR_THOLD2            DAC_SHHR_THOLD2_Msk                     /*!< DAC channel2 hold time
                                                                                (only valid in sample and hold mode) */

/* *************************************  Bit definition for DAC_SHRR register  ************************************* */
#define DAC_SHRR_TREFRESH1_Pos     (0U)
#define DAC_SHRR_TREFRESH1_Msk     (0xFFUL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x000000FF */
#define DAC_SHRR_TREFRESH1         DAC_SHRR_TREFRESH1_Msk                  /*!< DAC channel1 refresh time
                                                                                (only valid in sample and hold mode) */
#define DAC_SHRR_TREFRESH1_0       (0x1UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000001 */
#define DAC_SHRR_TREFRESH1_1       (0x2UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000002 */
#define DAC_SHRR_TREFRESH1_2       (0x4UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000004 */
#define DAC_SHRR_TREFRESH1_3       (0x8UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000008 */
#define DAC_SHRR_TREFRESH1_4       (0x10UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000010 */
#define DAC_SHRR_TREFRESH1_5       (0x20UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000020 */
#define DAC_SHRR_TREFRESH1_6       (0x40UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000040 */
#define DAC_SHRR_TREFRESH1_7       (0x80UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000080 */
#define DAC_SHRR_TREFRESH2_Pos     (16U)
#define DAC_SHRR_TREFRESH2_Msk     (0xFFUL << DAC_SHRR_TREFRESH2_Pos)      /*!< 0x00FF0000 */
#define DAC_SHRR_TREFRESH2         DAC_SHRR_TREFRESH2_Msk                  /*!< DAC channel2 refresh time
                                                                                (only valid in sample and hold mode) */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                            Debug MCU (DBGMCU)                                                      */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* **********************************  Bit definition for DBGMCU_IDCODE register  *********************************** */
#define DBGMCU_IDCODE_DEV_ID_Pos               (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk               (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos)               /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                   DBGMCU_IDCODE_DEV_ID_Msk                            /*!< Device
                                                                                                        identification
                                                                                                        */
#define DBGMCU_IDCODE_REV_ID_Pos               (16U)
#define DBGMCU_IDCODE_REV_ID_Msk               (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos)              /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID                   DBGMCU_IDCODE_REV_ID_Msk                            /*!< Revision of the
                                                                                                        device */

