MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* ************************************  Bit definition for FLASH_CCR register  ************************************* */
#define FLASH_CCR_CLR_EOP_Pos               (16U)
#define FLASH_CCR_CLR_EOP_Msk               (0x1UL << FLASH_CCR_CLR_EOP_Pos)                 /*!< 0x00010000 */
#define FLASH_CCR_CLR_EOP                   FLASH_CCR_CLR_EOP_Msk                            /*!< EOP flag clear bit */
#define FLASH_CCR_CLR_WRPERR_Pos            (17U)
#define FLASH_CCR_CLR_WRPERR_Msk            (0x1UL << FLASH_CCR_CLR_WRPERR_Pos)              /*!< 0x00020000 */
#define FLASH_CCR_CLR_WRPERR                FLASH_CCR_CLR_WRPERR_Msk                         /*!< WRPERR flag clear bit
                                                                                                  */
#define FLASH_CCR_CLR_PGSERR_Pos            (18U)
#define FLASH_CCR_CLR_PGSERR_Msk            (0x1UL << FLASH_CCR_CLR_PGSERR_Pos)              /*!< 0x00040000 */
#define FLASH_CCR_CLR_PGSERR                FLASH_CCR_CLR_PGSERR_Msk                         /*!< PGSERR flag clear bit
                                                                                                  */
#define FLASH_CCR_CLR_STRBERR_Pos           (19U)
#define FLASH_CCR_CLR_STRBERR_Msk           (0x1UL << FLASH_CCR_CLR_STRBERR_Pos)             /*!< 0x00080000 */
#define FLASH_CCR_CLR_STRBERR               FLASH_CCR_CLR_STRBERR_Msk                        /*!< STRBERR flag clear bit
                                                                                                  */
#define FLASH_CCR_CLR_INCERR_Pos            (20U)
#define FLASH_CCR_CLR_INCERR_Msk            (0x1UL << FLASH_CCR_CLR_INCERR_Pos)              /*!< 0x00100000 */
#define FLASH_CCR_CLR_INCERR                FLASH_CCR_CLR_INCERR_Msk                         /*!< INCERR flag clear bit
                                                                                                  */
#define FLASH_CCR_CLR_OPTCHANGEERR_Pos      (23U)
#define FLASH_CCR_CLR_OPTCHANGEERR_Msk      (0x1UL << FLASH_CCR_CLR_OPTCHANGEERR_Pos)        /*!< 0x00800000 */
#define FLASH_CCR_CLR_OPTCHANGEERR          FLASH_CCR_CLR_OPTCHANGEERR_Msk                   /*!< Clear the flag
                                                                                                  corresponding flag in
                                                                                                  FLASH_SR by writing
                                                                                                  this bit. */

/* **********************************  Bit definition for FLASH_PRIVCFGR register  ********************************** */
#define FLASH_PRIVCFGR_PRIV_Pos             (1U)
#define FLASH_PRIVCFGR_PRIV_Msk             (0x1UL << FLASH_PRIVCFGR_PRIV_Pos)               /*!< 0x00000002 */
#define FLASH_PRIVCFGR_PRIV                 FLASH_PRIVCFGR_PRIV_Msk                          /*!< privilege attribute */

/* **********************************  Bit definition for FLASH_HDPEXTR register  *********************************** */
#define FLASH_HDPEXTR_HDP1_EXT_Pos          (0U)
#define FLASH_HDPEXTR_HDP1_EXT_Msk          (0xFUL << FLASH_HDPEXTR_HDP1_EXT_Pos)            /*!< 0x0000000F */
#define FLASH_HDPEXTR_HDP1_EXT              FLASH_HDPEXTR_HDP1_EXT_Msk                       /*!< HDP area extension in
                                                                                                  8 Kbytes pages in
                                                                                                  bank1. Extension is
                                                                                                  added after the
                                                                                                  HDP1_END page
                                                                                                  (included). */
#define FLASH_HDPEXTR_HDP2_EXT_Pos          (16U)
#define FLASH_HDPEXTR_HDP2_EXT_Msk          (0xFUL << FLASH_HDPEXTR_HDP2_EXT_Pos)            /*!< 0x000F0000 */
#define FLASH_HDPEXTR_HDP2_EXT              FLASH_HDPEXTR_HDP2_EXT_Msk                       /*!< HDP area extension in
                                                                                                  8 Kbytes pages in
                                                                                                  bank2. Extension is
                                                                                                  added after the
                                                                                                  HDP2_END page
                                                                                                  (included). */

/* *********************************  Bit definition for FLASH_OPTSR_CUR register  ********************************** */
#define FLASH_OPTSR_CUR_IWDG_SW_Pos         (3U)
#define FLASH_OPTSR_CUR_IWDG_SW_Msk         (0x1UL << FLASH_OPTSR_CUR_IWDG_SW_Pos)           /*!< 0x00000008 */
#define FLASH_OPTSR_CUR_IWDG_SW             FLASH_OPTSR_CUR_IWDG_SW_Msk                      /*!< IWDG control mode
                                                                                                  option status bit */
#define FLASH_OPTSR_CUR_WWDG_SW_Pos         (4U)
#define FLASH_OPTSR_CUR_WWDG_SW_Msk         (0x1UL << FLASH_OPTSR_CUR_WWDG_SW_Pos)           /*!< 0x00000010 */
#define FLASH_OPTSR_CUR_WWDG_SW             FLASH_OPTSR_CUR_WWDG_SW_Msk                      /*!< WWDG control mode
                                                                                                  option status bit */
#define FLASH_OPTSR_CUR_NRST_STOP_Pos       (6U)
#define FLASH_OPTSR_CUR_NRST_STOP_Msk       (0x1UL << FLASH_OPTSR_CUR_NRST_STOP_Pos)         /*!< 0x00000040 */
#define FLASH_OPTSR_CUR_NRST_STOP           FLASH_OPTSR_CUR_NRST_STOP_Msk                    /*!< Core domain Stop entry
                                                                                                  reset option status
                                                                                                  bit */
#define FLASH_OPTSR_CUR_NRST_STDBY_Pos      (7U)
#define FLASH_OPTSR_CUR_NRST_STDBY_Msk      (0x1UL << FLASH_OPTSR_CUR_NRST_STDBY_Pos)        /*!< 0x00000080 */
#define FLASH_OPTSR_CUR_NRST_STDBY          FLASH_OPTSR_CUR_NRST_STDBY_Msk                   /*!< Core domain Standby
                                                                                                  entry reset option
                                                                                                  status bit */
#define FLASH_OPTSR_CUR_RDP_LEVEL_Pos       (8U)
#define FLASH_OPTSR_CUR_RDP_LEVEL_Msk       (0xFFUL << FLASH_OPTSR_CUR_RDP_LEVEL_Pos)        /*!< 0x0000FF00 */
#define FLASH_OPTSR_CUR_RDP_LEVEL           FLASH_OPTSR_CUR_RDP_LEVEL_Msk                    /*!< RDP level code (based
                                                                                                  on Hamming 8,4) */
#define FLASH_OPTSR_CUR_IWDG_STOP_Pos       (20U)
#define FLASH_OPTSR_CUR_IWDG_STOP_Msk       (0x1UL << FLASH_OPTSR_CUR_IWDG_STOP_Pos)         /*!< 0x00100000 */
#define FLASH_OPTSR_CUR_IWDG_STOP           FLASH_OPTSR_CUR_IWDG_STOP_Msk                    /*!< IWDG Stop mode freeze
                                                                                                  option status bit */
#define FLASH_OPTSR_CUR_IWDG_STDBY_Pos      (21U)
#define FLASH_OPTSR_CUR_IWDG_STDBY_Msk      (0x1UL << FLASH_OPTSR_CUR_IWDG_STDBY_Pos)        /*!< 0x00200000 */
#define FLASH_OPTSR_CUR_IWDG_STDBY          FLASH_OPTSR_CUR_IWDG_STDBY_Msk                   /*!< IWDG Standby mode
                                                                                                  freeze option status
                                                                                                  bit */
#define FLASH_OPTSR_CUR_BOOT_SEL_Pos        (22U)
#define FLASH_OPTSR_CUR_BOOT_SEL_Msk        (0x1UL << FLASH_OPTSR_CUR_BOOT_SEL_Pos)          /*!< 0x00400000 */
#define FLASH_OPTSR_CUR_BOOT_SEL            FLASH_OPTSR_CUR_BOOT_SEL_Msk                     /*!< Boot 0 source
                                                                                                  selection */
#define FLASH_OPTSR_CUR_BOOT0_Pos           (23U)
#define FLASH_OPTSR_CUR_BOOT0_Msk           (0x1UL << FLASH_OPTSR_CUR_BOOT0_Pos)             /*!< 0x00800000 */
#define FLASH_OPTSR_CUR_BOOT0               FLASH_OPTSR_CUR_BOOT0_Msk                        /*!< Boot 0 option bit */
#define FLASH_OPTSR_CUR_EDATA_EN_Pos        (29U)
#define FLASH_OPTSR_CUR_EDATA_EN_Msk        (0x1UL << FLASH_OPTSR_CUR_EDATA_EN_Pos)          /*!< 0x20000000 */
#define FLASH_OPTSR_CUR_EDATA_EN            FLASH_OPTSR_CUR_EDATA_EN_Msk                     /*!< Flash data area enable
                                                                                                  */
#define FLASH_OPTSR_CUR_SINGLE_BANK_Pos     (30U)
#define FLASH_OPTSR_CUR_SINGLE_BANK_Msk     (0x1UL << FLASH_OPTSR_CUR_SINGLE_BANK_Pos)       /*!< 0x40000000 */
#define FLASH_OPTSR_CUR_SINGLE_BANK         FLASH_OPTSR_CUR_SINGLE_BANK_Msk                  /*!< Dual bank selection
                                                                                                  option status bit */
#define FLASH_OPTSR_CUR_SWAP_BANK_Pos       (31U)
#define FLASH_OPTSR_CUR_SWAP_BANK_Msk       (0x1UL << FLASH_OPTSR_CUR_SWAP_BANK_Pos)         /*!< 0x80000000 */
#define FLASH_OPTSR_CUR_SWAP_BANK           FLASH_OPTSR_CUR_SWAP_BANK_Msk                    /*!< Bank swapping option
                                                                                                  status bit */

