MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* *********************************  Bit definition for FLASH_OPTSR_PRG register  ********************************** */
#define FLASH_OPTSR_PRG_IWDG_SW_Pos         (3U)
#define FLASH_OPTSR_PRG_IWDG_SW_Msk         (0x1UL << FLASH_OPTSR_PRG_IWDG_SW_Pos)           /*!< 0x00000008 */
#define FLASH_OPTSR_PRG_IWDG_SW             FLASH_OPTSR_PRG_IWDG_SW_Msk                      /*!< IWDG control mode
                                                                                                  option configuration
                                                                                                  bit */
#define FLASH_OPTSR_PRG_WWDG_SW_Pos         (4U)
#define FLASH_OPTSR_PRG_WWDG_SW_Msk         (0x1UL << FLASH_OPTSR_PRG_WWDG_SW_Pos)           /*!< 0x00000010 */
#define FLASH_OPTSR_PRG_WWDG_SW             FLASH_OPTSR_PRG_WWDG_SW_Msk                      /*!< WWDG control mode
                                                                                                  option configuration
                                                                                                  bit */
#define FLASH_OPTSR_PRG_NRST_STOP_Pos       (6U)
#define FLASH_OPTSR_PRG_NRST_STOP_Msk       (0x1UL << FLASH_OPTSR_PRG_NRST_STOP_Pos)         /*!< 0x00000040 */
#define FLASH_OPTSR_PRG_NRST_STOP           FLASH_OPTSR_PRG_NRST_STOP_Msk                    /*!< Core domain Stop entry
                                                                                                  reset option
                                                                                                  configuration bit */
#define FLASH_OPTSR_PRG_NRST_STDBY_Pos      (7U)
#define FLASH_OPTSR_PRG_NRST_STDBY_Msk      (0x1UL << FLASH_OPTSR_PRG_NRST_STDBY_Pos)        /*!< 0x00000080 */
#define FLASH_OPTSR_PRG_NRST_STDBY          FLASH_OPTSR_PRG_NRST_STDBY_Msk                   /*!< Core domain Standby
                                                                                                  entry reset option
                                                                                                  configuration bit */
#define FLASH_OPTSR_PRG_RDP_LEVEL_Pos       (8U)
#define FLASH_OPTSR_PRG_RDP_LEVEL_Msk       (0xFFUL << FLASH_OPTSR_PRG_RDP_LEVEL_Pos)        /*!< 0x0000FF00 */
#define FLASH_OPTSR_PRG_RDP_LEVEL           FLASH_OPTSR_PRG_RDP_LEVEL_Msk                    /*!< RDP level code (based
                                                                                                  on Hamming 8,4) */
#define FLASH_OPTSR_PRG_IWDG_STOP_Pos       (20U)
#define FLASH_OPTSR_PRG_IWDG_STOP_Msk       (0x1UL << FLASH_OPTSR_PRG_IWDG_STOP_Pos)         /*!< 0x00100000 */
#define FLASH_OPTSR_PRG_IWDG_STOP           FLASH_OPTSR_PRG_IWDG_STOP_Msk                    /*!< IWDG Stop mode freeze
                                                                                                  option configuration
                                                                                                  bit */
#define FLASH_OPTSR_PRG_IWDG_STDBY_Pos      (21U)
#define FLASH_OPTSR_PRG_IWDG_STDBY_Msk      (0x1UL << FLASH_OPTSR_PRG_IWDG_STDBY_Pos)        /*!< 0x00200000 */
#define FLASH_OPTSR_PRG_IWDG_STDBY          FLASH_OPTSR_PRG_IWDG_STDBY_Msk                   /*!< IWDG Standby mode
                                                                                                  freeze option
                                                                                                  configuration bit */
#define FLASH_OPTSR_PRG_BOOT_SEL_Pos        (22U)
#define FLASH_OPTSR_PRG_BOOT_SEL_Msk        (0x1UL << FLASH_OPTSR_PRG_BOOT_SEL_Pos)          /*!< 0x00400000 */
#define FLASH_OPTSR_PRG_BOOT_SEL            FLASH_OPTSR_PRG_BOOT_SEL_Msk                     /*!< Boot 0 source
                                                                                                  configuration */
#define FLASH_OPTSR_PRG_BOOT0_Pos           (23U)
#define FLASH_OPTSR_PRG_BOOT0_Msk           (0x1UL << FLASH_OPTSR_PRG_BOOT0_Pos)             /*!< 0x00800000 */
#define FLASH_OPTSR_PRG_BOOT0               FLASH_OPTSR_PRG_BOOT0_Msk                        /*!< Boot 0 option bit */
#define FLASH_OPTSR_PRG_EDATA_EN_Pos        (29U)
#define FLASH_OPTSR_PRG_EDATA_EN_Msk        (0x1UL << FLASH_OPTSR_PRG_EDATA_EN_Pos)          /*!< 0x20000000 */
#define FLASH_OPTSR_PRG_EDATA_EN            FLASH_OPTSR_PRG_EDATA_EN_Msk                     /*!< Flash data area enable
                                                                                                  */
#define FLASH_OPTSR_PRG_SINGLE_BANK_Pos     (30U)
#define FLASH_OPTSR_PRG_SINGLE_BANK_Msk     (0x1UL << FLASH_OPTSR_PRG_SINGLE_BANK_Pos)       /*!< 0x40000000 */
#define FLASH_OPTSR_PRG_SINGLE_BANK         FLASH_OPTSR_PRG_SINGLE_BANK_Msk                  /*!< Dual bank option
                                                                                                  configuration bit */
#define FLASH_OPTSR_PRG_SWAP_BANK_Pos       (31U)
#define FLASH_OPTSR_PRG_SWAP_BANK_Msk       (0x1UL << FLASH_OPTSR_PRG_SWAP_BANK_Pos)         /*!< 0x80000000 */
#define FLASH_OPTSR_PRG_SWAP_BANK           FLASH_OPTSR_PRG_SWAP_BANK_Msk                    /*!< Bank swapping option
                                                                                                  configuration bit */

/* *********************************  Bit definition for FLASH_OPTSR2_CUR register  ********************************* */
#define FLASH_OPTSR2_CUR_SRAM1_RST_Pos      (0U)
#define FLASH_OPTSR2_CUR_SRAM1_RST_Msk      (0x1UL << FLASH_OPTSR2_CUR_SRAM1_RST_Pos)        /*!< 0x00000001 */
#define FLASH_OPTSR2_CUR_SRAM1_RST          FLASH_OPTSR2_CUR_SRAM1_RST_Msk                   /*!< SRAM1 erase upon
                                                                                                  system reset */
#define FLASH_OPTSR2_CUR_SRAM2_RST_Pos      (1U)
#define FLASH_OPTSR2_CUR_SRAM2_RST_Msk      (0x1UL << FLASH_OPTSR2_CUR_SRAM2_RST_Pos)        /*!< 0x00000002 */
#define FLASH_OPTSR2_CUR_SRAM2_RST          FLASH_OPTSR2_CUR_SRAM2_RST_Msk                   /*!< SRAM2 erase when
                                                                                                  system reset */
#define FLASH_OPTSR2_CUR_SRAM2_ECC_Pos      (4U)
#define FLASH_OPTSR2_CUR_SRAM2_ECC_Msk      (0x1UL << FLASH_OPTSR2_CUR_SRAM2_ECC_Pos)        /*!< 0x00000010 */
#define FLASH_OPTSR2_CUR_SRAM2_ECC          FLASH_OPTSR2_CUR_SRAM2_ECC_Msk                   /*!< SRAM2 ECC detection
                                                                                                  and correction disable
                                                                                                  */

/* *********************************  Bit definition for FLASH_OPTSR2_PRG register  ********************************* */
#define FLASH_OPTSR2_PRG_SRAM1_RST_Pos      (0U)
#define FLASH_OPTSR2_PRG_SRAM1_RST_Msk      (0x1UL << FLASH_OPTSR2_PRG_SRAM1_RST_Pos)        /*!< 0x00000001 */
#define FLASH_OPTSR2_PRG_SRAM1_RST          FLASH_OPTSR2_PRG_SRAM1_RST_Msk                   /*!< SRAM1 erase upon
                                                                                                  system reset */
#define FLASH_OPTSR2_PRG_SRAM2_RST_Pos      (1U)
#define FLASH_OPTSR2_PRG_SRAM2_RST_Msk      (0x1UL << FLASH_OPTSR2_PRG_SRAM2_RST_Pos)        /*!< 0x00000002 */
#define FLASH_OPTSR2_PRG_SRAM2_RST          FLASH_OPTSR2_PRG_SRAM2_RST_Msk                   /*!< SRAM2 erase when
                                                                                                  system reset */
#define FLASH_OPTSR2_PRG_SRAM2_ECC_Pos      (4U)
#define FLASH_OPTSR2_PRG_SRAM2_ECC_Msk      (0x1UL << FLASH_OPTSR2_PRG_SRAM2_ECC_Pos)        /*!< 0x00000010 */
#define FLASH_OPTSR2_PRG_SRAM2_ECC          FLASH_OPTSR2_PRG_SRAM2_ECC_Msk                   /*!< SRAM2 ECC detection
                                                                                                  and correction disable
                                                                                                  */

/* *********************************  Bit definition for FLASH_BOOTR_CUR register  ********************************** */
#define FLASH_BOOTR_CUR_BOOT_LOCK_Pos       (0U)
#define FLASH_BOOTR_CUR_BOOT_LOCK_Msk       (0xFFUL << FLASH_BOOTR_CUR_BOOT_LOCK_Pos)        /*!< 0x000000FF */
#define FLASH_BOOTR_CUR_BOOT_LOCK           FLASH_BOOTR_CUR_BOOT_LOCK_Msk                    /*!< A field locking the
                                                                                                  values of BOOT0,
                                                                                                  BOOT_SEL, SWAP_BANK,
                                                                                                  and BOOTADD option
                                                                                                  settings. */
#define FLASH_BOOTR_CUR_BOOTADD_Pos         (8U)
#define FLASH_BOOTR_CUR_BOOTADD_Msk         (0xFFFFFFUL << FLASH_BOOTR_CUR_BOOTADD_Pos)      /*!< 0xFFFFFF00 */
#define FLASH_BOOTR_CUR_BOOTADD             FLASH_BOOTR_CUR_BOOTADD_Msk                      /*!< unique boot entry
                                                                                                  address */

