MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/*******************  Bit definition for I3C_DCR register  ********************/
#define I3C_DCR_DCR_Pos                 (0U)
#define I3C_DCR_DCR_Msk                 (0xFFUL << I3C_DCR_DCR_Pos)               /*!< 0x000000FF */
#define I3C_DCR_DCR                     I3C_DCR_DCR_Msk                           /*!< Devices Characteristics */

/*****************  Bit definition for I3C_GETCAPR register  ******************/
#define I3C_GETCAPR_CAPPEND_Pos         (14U)
#define I3C_GETCAPR_CAPPEND_Msk         (0x1UL << I3C_GETCAPR_CAPPEND_Pos)        /*!< 0x00004000 */
#define I3C_GETCAPR_CAPPEND             I3C_GETCAPR_CAPPEND_Msk                   /*!< IBI Request with Mandatory Data Byte */

/*****************  Bit definition for I3C_CRCAPR register  *******************/
#define I3C_CRCAPR_CAPDHOFF_Pos         (3U)
#define I3C_CRCAPR_CAPDHOFF_Msk         (0x1UL << I3C_CRCAPR_CAPDHOFF_Pos)        /*!< 0x00000008 */
#define I3C_CRCAPR_CAPDHOFF             I3C_CRCAPR_CAPDHOFF_Msk                   /*!< Controller-role handoff needed */
#define I3C_CRCAPR_CAPGRP_Pos           (9U)
#define I3C_CRCAPR_CAPGRP_Msk           (0x1UL << I3C_CRCAPR_CAPGRP_Pos)          /*!< 0x00000200 */
#define I3C_CRCAPR_CAPGRP               I3C_CRCAPR_CAPGRP_Msk                     /*!< Group Address handoff supported */

/****************  Bit definition for I3C_GETMXDSR register  ******************/
#define I3C_GETMXDSR_HOFFAS_Pos         (0U)
#define I3C_GETMXDSR_HOFFAS_Msk         (0x3UL << I3C_GETMXDSR_HOFFAS_Pos)        /*!< 0x00000003 */
#define I3C_GETMXDSR_HOFFAS             I3C_GETMXDSR_HOFFAS_Msk                   /*!< Handoff Activity State */
#define I3C_GETMXDSR_HOFFAS_0           (0x1UL << I3C_GETMXDSR_HOFFAS_Pos)        /*!< 0x00000001 */
#define I3C_GETMXDSR_HOFFAS_1           (0x2UL << I3C_GETMXDSR_HOFFAS_Pos)        /*!< 0x00000002 */
#define I3C_GETMXDSR_FMT_Pos            (8U)
#define I3C_GETMXDSR_FMT_Msk            (0x3UL << I3C_GETMXDSR_FMT_Pos)           /*!< 0x00000300 */
#define I3C_GETMXDSR_FMT                I3C_GETMXDSR_FMT_Msk                      /*!< Get Max Data Speed response in format 2 */
#define I3C_GETMXDSR_FMT_0              (0x1UL << I3C_GETMXDSR_FMT_Pos)           /*!< 0x00000100 */
#define I3C_GETMXDSR_FMT_1              (0x2UL << I3C_GETMXDSR_FMT_Pos)           /*!< 0x00000200 */
#define I3C_GETMXDSR_RDTURN_Pos         (16U)
#define I3C_GETMXDSR_RDTURN_Msk         (0xFFUL << I3C_GETMXDSR_RDTURN_Pos)       /*!< 0x00FF0000 */
#define I3C_GETMXDSR_RDTURN             I3C_GETMXDSR_RDTURN_Msk                   /*!< Max Read Turnaround Middle Byte  */
#define I3C_GETMXDSR_TSCO_Pos           (24U)
#define I3C_GETMXDSR_TSCO_Msk           (0x1UL << I3C_GETMXDSR_TSCO_Pos)          /*!< 0x01000000 */
#define I3C_GETMXDSR_TSCO               I3C_GETMXDSR_TSCO_Msk                     /*!< Clock-to-data Turnaround time */

/******************  Bit definition for I3C_EPIDR register  *******************/
#define I3C_EPIDR_MIPIID_Pos            (12U)
#define I3C_EPIDR_MIPIID_Msk            (0xFUL << I3C_EPIDR_MIPIID_Pos)           /*!< 0x0000F000 */
#define I3C_EPIDR_MIPIID                I3C_EPIDR_MIPIID_Msk                      /*!< MIPI Instance ID */
#define I3C_EPIDR_IDTSEL_Pos            (16U)
#define I3C_EPIDR_IDTSEL_Msk            (0x1UL << I3C_EPIDR_IDTSEL_Pos)           /*!< 0x00010000 */
#define I3C_EPIDR_IDTSEL                I3C_EPIDR_IDTSEL_Msk                      /*!< ID Type Selector */
#define I3C_EPIDR_MIPIMID_Pos           (17U)
#define I3C_EPIDR_MIPIMID_Msk           (0x7FFFUL << I3C_EPIDR_MIPIMID_Pos)       /*!< 0xFFFE0000 */
#define I3C_EPIDR_MIPIMID               I3C_EPIDR_MIPIMID_Msk                     /*!< MIPI Manufacturer ID */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                             Instruction cache (ICACHE)                                             */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* ************************************  Bit definition for ICACHE_CR register  ************************************* */
#define ICACHE_CR_EN_Pos          (0U)
#define ICACHE_CR_EN_Msk          (0x1UL << ICACHE_CR_EN_Pos)            /*!< 0x00000001 */
#define ICACHE_CR_EN              ICACHE_CR_EN_Msk                       /*!< enable */
#define ICACHE_CR_CACHEINV_Pos    (1U)
#define ICACHE_CR_CACHEINV_Msk    (0x1UL << ICACHE_CR_CACHEINV_Pos)      /*!< 0x00000002 */
#define ICACHE_CR_CACHEINV        ICACHE_CR_CACHEINV_Msk                 /*!< cache invalidation */
#define ICACHE_CR_WAYSEL_Pos      (2U)
#define ICACHE_CR_WAYSEL_Msk      (0x1UL << ICACHE_CR_WAYSEL_Pos)        /*!< 0x00000004 */
#define ICACHE_CR_WAYSEL          ICACHE_CR_WAYSEL_Msk                   /*!< cache associativity mode selection */
#define ICACHE_CR_HITMEN_Pos      (16U)
#define ICACHE_CR_HITMEN_Msk      (0x1UL << ICACHE_CR_HITMEN_Pos)        /*!< 0x00010000 */
#define ICACHE_CR_HITMEN          ICACHE_CR_HITMEN_Msk                   /*!< hit monitor enable */
#define ICACHE_CR_MISSMEN_Pos     (17U)
#define ICACHE_CR_MISSMEN_Msk     (0x1UL << ICACHE_CR_MISSMEN_Pos)       /*!< 0x00020000 */
#define ICACHE_CR_MISSMEN         ICACHE_CR_MISSMEN_Msk                  /*!< miss monitor enable */
#define ICACHE_CR_HITMRST_Pos     (18U)
#define ICACHE_CR_HITMRST_Msk     (0x1UL << ICACHE_CR_HITMRST_Pos)       /*!< 0x00040000 */
#define ICACHE_CR_HITMRST         ICACHE_CR_HITMRST_Msk                  /*!< hit monitor reset */
#define ICACHE_CR_MISSMRST_Pos    (19U)
#define ICACHE_CR_MISSMRST_Msk    (0x1UL << ICACHE_CR_MISSMRST_Pos)      /*!< 0x00080000 */
#define ICACHE_CR_MISSMRST        ICACHE_CR_MISSMRST_Msk                 /*!< miss monitor reset */

