MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/* ************************************  Bit definition for ICACHE_SR register  ************************************* */
#define ICACHE_SR_BUSYF_Pos       (0U)
#define ICACHE_SR_BUSYF_Msk       (0x1UL << ICACHE_SR_BUSYF_Pos)         /*!< 0x00000001 */
#define ICACHE_SR_BUSYF           ICACHE_SR_BUSYF_Msk                    /*!< busy flag */
#define ICACHE_SR_BSYENDF_Pos     (1U)
#define ICACHE_SR_BSYENDF_Msk     (0x1UL << ICACHE_SR_BSYENDF_Pos)       /*!< 0x00000002 */
#define ICACHE_SR_BSYENDF         ICACHE_SR_BSYENDF_Msk                  /*!< busy end flag */
#define ICACHE_SR_ERRF_Pos        (2U)
#define ICACHE_SR_ERRF_Msk        (0x1UL << ICACHE_SR_ERRF_Pos)          /*!< 0x00000004 */
#define ICACHE_SR_ERRF            ICACHE_SR_ERRF_Msk                     /*!< cache error flag */

/* ************************************  Bit definition for ICACHE_IER register  ************************************ */
#define ICACHE_IER_BSYENDIE_Pos   (1U)
#define ICACHE_IER_BSYENDIE_Msk   (0x1UL << ICACHE_IER_BSYENDIE_Pos)     /*!< 0x00000002 */
#define ICACHE_IER_BSYENDIE       ICACHE_IER_BSYENDIE_Msk                /*!< interrupt enable on busy end */
#define ICACHE_IER_ERRIE_Pos      (2U)
#define ICACHE_IER_ERRIE_Msk      (0x1UL << ICACHE_IER_ERRIE_Pos)        /*!< 0x00000004 */
#define ICACHE_IER_ERRIE          ICACHE_IER_ERRIE_Msk                   /*!< interrupt enable on cache error */

/* ************************************  Bit definition for ICACHE_FCR register  ************************************ */
#define ICACHE_FCR_CBSYENDF_Pos   (1U)
#define ICACHE_FCR_CBSYENDF_Msk   (0x1UL << ICACHE_FCR_CBSYENDF_Pos)     /*!< 0x00000002 */
#define ICACHE_FCR_CBSYENDF       ICACHE_FCR_CBSYENDF_Msk                /*!< clear busy end flag */
#define ICACHE_FCR_CERRF_Pos      (2U)
#define ICACHE_FCR_CERRF_Msk      (0x1UL << ICACHE_FCR_CERRF_Pos)        /*!< 0x00000004 */
#define ICACHE_FCR_CERRF          ICACHE_FCR_CERRF_Msk                   /*!< clear cache error flag */

/* ***********************************  Bit definition for ICACHE_HMONR register  *********************************** */
#define ICACHE_HMONR_HITMON_Pos   (0U)
#define ICACHE_HMONR_HITMON_Msk   (0xFFFFFFFFUL << ICACHE_HMONR_HITMON_Pos)     /*!< 0xFFFFFFFF */
#define ICACHE_HMONR_HITMON       ICACHE_HMONR_HITMON_Msk                       /*!< cache hit monitor counter */
#define ICACHE_HMONR_HITMON_0     (0x1UL << ICACHE_HMONR_HITMON_Pos)            /*!< 0x00000001 */
#define ICACHE_HMONR_HITMON_1     (0x2UL << ICACHE_HMONR_HITMON_Pos)            /*!< 0x00000002 */
#define ICACHE_HMONR_HITMON_2     (0x4UL << ICACHE_HMONR_HITMON_Pos)            /*!< 0x00000004 */
#define ICACHE_HMONR_HITMON_3     (0x8UL << ICACHE_HMONR_HITMON_Pos)            /*!< 0x00000008 */
#define ICACHE_HMONR_HITMON_4     (0x10UL << ICACHE_HMONR_HITMON_Pos)           /*!< 0x00000010 */
#define ICACHE_HMONR_HITMON_5     (0x20UL << ICACHE_HMONR_HITMON_Pos)           /*!< 0x00000020 */
#define ICACHE_HMONR_HITMON_6     (0x40UL << ICACHE_HMONR_HITMON_Pos)           /*!< 0x00000040 */
#define ICACHE_HMONR_HITMON_7     (0x80UL << ICACHE_HMONR_HITMON_Pos)           /*!< 0x00000080 */
#define ICACHE_HMONR_HITMON_8     (0x100UL << ICACHE_HMONR_HITMON_Pos)          /*!< 0x00000100 */
#define ICACHE_HMONR_HITMON_9     (0x200UL << ICACHE_HMONR_HITMON_Pos)          /*!< 0x00000200 */
#define ICACHE_HMONR_HITMON_10    (0x400UL << ICACHE_HMONR_HITMON_Pos)          /*!< 0x00000400 */
#define ICACHE_HMONR_HITMON_11    (0x800UL << ICACHE_HMONR_HITMON_Pos)          /*!< 0x00000800 */
#define ICACHE_HMONR_HITMON_12    (0x1000UL << ICACHE_HMONR_HITMON_Pos)         /*!< 0x00001000 */
#define ICACHE_HMONR_HITMON_13    (0x2000UL << ICACHE_HMONR_HITMON_Pos)         /*!< 0x00002000 */
#define ICACHE_HMONR_HITMON_14    (0x4000UL << ICACHE_HMONR_HITMON_Pos)         /*!< 0x00004000 */
#define ICACHE_HMONR_HITMON_15    (0x8000UL << ICACHE_HMONR_HITMON_Pos)         /*!< 0x00008000 */
#define ICACHE_HMONR_HITMON_16    (0x10000UL << ICACHE_HMONR_HITMON_Pos)        /*!< 0x00010000 */
#define ICACHE_HMONR_HITMON_17    (0x20000UL << ICACHE_HMONR_HITMON_Pos)        /*!< 0x00020000 */
#define ICACHE_HMONR_HITMON_18    (0x40000UL << ICACHE_HMONR_HITMON_Pos)        /*!< 0x00040000 */
#define ICACHE_HMONR_HITMON_19    (0x80000UL << ICACHE_HMONR_HITMON_Pos)        /*!< 0x00080000 */
#define ICACHE_HMONR_HITMON_20    (0x100000UL << ICACHE_HMONR_HITMON_Pos)       /*!< 0x00100000 */
#define ICACHE_HMONR_HITMON_21    (0x200000UL << ICACHE_HMONR_HITMON_Pos)       /*!< 0x00200000 */
#define ICACHE_HMONR_HITMON_22    (0x400000UL << ICACHE_HMONR_HITMON_Pos)       /*!< 0x00400000 */
#define ICACHE_HMONR_HITMON_23    (0x800000UL << ICACHE_HMONR_HITMON_Pos)       /*!< 0x00800000 */
#define ICACHE_HMONR_HITMON_24    (0x1000000UL << ICACHE_HMONR_HITMON_Pos)      /*!< 0x01000000 */
#define ICACHE_HMONR_HITMON_25    (0x2000000UL << ICACHE_HMONR_HITMON_Pos)      /*!< 0x02000000 */
#define ICACHE_HMONR_HITMON_26    (0x4000000UL << ICACHE_HMONR_HITMON_Pos)      /*!< 0x04000000 */
#define ICACHE_HMONR_HITMON_27    (0x8000000UL << ICACHE_HMONR_HITMON_Pos)      /*!< 0x08000000 */
#define ICACHE_HMONR_HITMON_28    (0x10000000UL << ICACHE_HMONR_HITMON_Pos)     /*!< 0x10000000 */
#define ICACHE_HMONR_HITMON_29    (0x20000000UL << ICACHE_HMONR_HITMON_Pos)     /*!< 0x20000000 */
#define ICACHE_HMONR_HITMON_30    (0x40000000UL << ICACHE_HMONR_HITMON_Pos)     /*!< 0x40000000 */
#define ICACHE_HMONR_HITMON_31    (0x80000000UL << ICACHE_HMONR_HITMON_Pos)     /*!< 0x80000000 */

/* ***********************************  Bit definition for ICACHE_MMONR register  *********************************** */
#define ICACHE_MMONR_MISSMON_Pos  (0U)
#define ICACHE_MMONR_MISSMON_Msk  (0xFFFFUL << ICACHE_MMONR_MISSMON_Pos) /*!< 0x0000FFFF */
#define ICACHE_MMONR_MISSMON      ICACHE_MMONR_MISSMON_Msk               /*!< cache miss monitor counter */
#define ICACHE_MMONR_MISSMON_0    (0x1UL << ICACHE_MMONR_MISSMON_Pos)    /*!< 0x00000001 */
#define ICACHE_MMONR_MISSMON_1    (0x2UL << ICACHE_MMONR_MISSMON_Pos)    /*!< 0x00000002 */
#define ICACHE_MMONR_MISSMON_2    (0x4UL << ICACHE_MMONR_MISSMON_Pos)    /*!< 0x00000004 */
#define ICACHE_MMONR_MISSMON_3    (0x8UL << ICACHE_MMONR_MISSMON_Pos)    /*!< 0x00000008 */
#define ICACHE_MMONR_MISSMON_4    (0x10UL << ICACHE_MMONR_MISSMON_Pos)   /*!< 0x00000010 */
#define ICACHE_MMONR_MISSMON_5    (0x20UL << ICACHE_MMONR_MISSMON_Pos)   /*!< 0x00000020 */
#define ICACHE_MMONR_MISSMON_6    (0x40UL << ICACHE_MMONR_MISSMON_Pos)   /*!< 0x00000040 */
#define ICACHE_MMONR_MISSMON_7    (0x80UL << ICACHE_MMONR_MISSMON_Pos)   /*!< 0x00000080 */
#define ICACHE_MMONR_MISSMON_8    (0x100UL << ICACHE_MMONR_MISSMON_Pos)  /*!< 0x00000100 */
#define ICACHE_MMONR_MISSMON_9    (0x200UL << ICACHE_MMONR_MISSMON_Pos)  /*!< 0x00000200 */
#define ICACHE_MMONR_MISSMON_10   (0x400UL << ICACHE_MMONR_MISSMON_Pos)  /*!< 0x00000400 */
#define ICACHE_MMONR_MISSMON_11   (0x800UL << ICACHE_MMONR_MISSMON_Pos)  /*!< 0x00000800 */
#define ICACHE_MMONR_MISSMON_12   (0x1000UL << ICACHE_MMONR_MISSMON_Pos) /*!< 0x00001000 */
#define ICACHE_MMONR_MISSMON_13   (0x2000UL << ICACHE_MMONR_MISSMON_Pos) /*!< 0x00002000 */
#define ICACHE_MMONR_MISSMON_14   (0x4000UL << ICACHE_MMONR_MISSMON_Pos) /*!< 0x00004000 */
#define ICACHE_MMONR_MISSMON_15   (0x8000UL << ICACHE_MMONR_MISSMON_Pos) /*!< 0x00008000 */

