MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/********************  Bit definition for TIM_SR register  ********************/
/*!< UIF configuration */
#define TIM_SR_UIF_Pos    (0U)
#define TIM_SR_UIF_Msk    (0x1UL << TIM_SR_UIF_Pos)    /*!< 0x00000001 */
#define TIM_SR_UIF        TIM_SR_UIF_Msk               /*!< UIF (Update interrupt flag) */
/*!< CC1IF configuration */
#define TIM_SR_CC1IF_Pos  (1U)
#define TIM_SR_CC1IF_Msk  (0x1UL << TIM_SR_CC1IF_Pos)  /*!< 0x00000002 */
#define TIM_SR_CC1IF      TIM_SR_CC1IF_Msk             /*!< CC1IF (Capture/compare 1 interrupt flag) */
/*!< CC2IF configuration */
#define TIM_SR_CC2IF_Pos  (2U)
#define TIM_SR_CC2IF_Msk  (0x1UL << TIM_SR_CC2IF_Pos)  /*!< 0x00000004 */
#define TIM_SR_CC2IF      TIM_SR_CC2IF_Msk             /*!< CC2IF (Capture/compare 2 interrupt flag) */
/*!< CC3IF configuration */
#define TIM_SR_CC3IF_Pos  (3U)
#define TIM_SR_CC3IF_Msk  (0x1UL << TIM_SR_CC3IF_Pos)  /*!< 0x00000008 */
#define TIM_SR_CC3IF      TIM_SR_CC3IF_Msk             /*!< CC3IF (Capture/compare 3 interrupt flag) */
/*!< CC4IF configuration */
#define TIM_SR_CC4IF_Pos  (4U)
#define TIM_SR_CC4IF_Msk  (0x1UL << TIM_SR_CC4IF_Pos)  /*!< 0x00000010 */
#define TIM_SR_CC4IF      TIM_SR_CC4IF_Msk             /*!< CC4IF (Capture/compare 4 interrupt flag) */
/*!< COMIF configuration */
#define TIM_SR_COMIF_Pos  (5U)
#define TIM_SR_COMIF_Msk  (0x1UL << TIM_SR_COMIF_Pos)  /*!< 0x00000020 */
#define TIM_SR_COMIF      TIM_SR_COMIF_Msk             /*!< COMIF (COM interrupt flag) */
/*!< TIF configuration */
#define TIM_SR_TIF_Pos    (6U)
#define TIM_SR_TIF_Msk    (0x1UL << TIM_SR_TIF_Pos)    /*!< 0x00000040 */
#define TIM_SR_TIF        TIM_SR_TIF_Msk               /*!< TIF (Trigger interrupt flag) */
/*!< BIF configuration */
#define TIM_SR_BIF_Pos    (7U)
#define TIM_SR_BIF_Msk    (0x1UL << TIM_SR_BIF_Pos)    /*!< 0x00000080 */
#define TIM_SR_BIF        TIM_SR_BIF_Msk               /*!< BIF (Break interrupt flag) */
/*!< B2IF configuration */
#define TIM_SR_B2IF_Pos   (8U)
#define TIM_SR_B2IF_Msk   (0x1UL << TIM_SR_B2IF_Pos)   /*!< 0x00000100 */
#define TIM_SR_B2IF       TIM_SR_B2IF_Msk              /*!< B2IF (Break 2 interrupt flag) */
/*!< CC1OF configuration */
#define TIM_SR_CC1OF_Pos  (9U)
#define TIM_SR_CC1OF_Msk  (0x1UL << TIM_SR_CC1OF_Pos)  /*!< 0x00000200 */
#define TIM_SR_CC1OF      TIM_SR_CC1OF_Msk             /*!< CC1OF (Capture/compare 1 overcapture flag) */
/*!< CC2OF configuration */
#define TIM_SR_CC2OF_Pos  (10U)
#define TIM_SR_CC2OF_Msk  (0x1UL << TIM_SR_CC2OF_Pos)  /*!< 0x00000400 */
#define TIM_SR_CC2OF      TIM_SR_CC2OF_Msk             /*!< CC2OF (Capture/compare 2 overcapture flag) */
/*!< CC3OF configuration */
#define TIM_SR_CC3OF_Pos  (11U)
#define TIM_SR_CC3OF_Msk  (0x1UL << TIM_SR_CC3OF_Pos)  /*!< 0x00000800 */
#define TIM_SR_CC3OF      TIM_SR_CC3OF_Msk             /*!< CC3OF (Capture/compare 3 overcapture flag) */
/*!< CC4OF configuration */
#define TIM_SR_CC4OF_Pos  (12U)
#define TIM_SR_CC4OF_Msk  (0x1UL << TIM_SR_CC4OF_Pos)  /*!< 0x00001000 */
#define TIM_SR_CC4OF      TIM_SR_CC4OF_Msk             /*!< CC4OF (Capture/compare 4 overcapture flag) */
/*!< SBIF configuration */
#define TIM_SR_SBIF_Pos   (13U)
#define TIM_SR_SBIF_Msk   (0x1UL << TIM_SR_SBIF_Pos)   /*!< 0x00002000 */
#define TIM_SR_SBIF       TIM_SR_SBIF_Msk              /*!< SBIF (System break interrupt flag) */
/*!< BGF configuration */
#define TIM_SR_BGF_Pos    (14U)
#define TIM_SR_BGF_Msk    (0x1UL << TIM_SR_BGF_Pos)    /*!< 0x00004000 */
#define TIM_SR_BGF        TIM_SR_BGF_Msk               /*!< BGF (Break generation flag) */
/*!< B2GF configuration */
#define TIM_SR_B2GF_Pos   (15U)
#define TIM_SR_B2GF_Msk   (0x1UL << TIM_SR_B2GF_Pos)   /*!< 0x00008000 */
#define TIM_SR_B2GF       TIM_SR_B2GF_Msk              /*!< B2GF (Break 2 generation flag) */
/*!< CC5IF configuration */
#define TIM_SR_CC5IF_Pos  (16U)
#define TIM_SR_CC5IF_Msk  (0x1UL << TIM_SR_CC5IF_Pos)  /*!< 0x00010000 */
#define TIM_SR_CC5IF      TIM_SR_CC5IF_Msk             /*!< CC5IF (Compare 5 interrupt flag) */
/*!< CC6IF configuration */
#define TIM_SR_CC6IF_Pos  (17U)
#define TIM_SR_CC6IF_Msk  (0x1UL << TIM_SR_CC6IF_Pos)  /*!< 0x00020000 */
#define TIM_SR_CC6IF      TIM_SR_CC6IF_Msk             /*!< CC6IF (Compare 6 interrupt flag) */
/*!< CC7IF configuration */
#define TIM_SR_CC7IF_Pos  (18U)
#define TIM_SR_CC7IF_Msk  (0x1UL << TIM_SR_CC7IF_Pos)  /*!< 0x00040000 */
#define TIM_SR_CC7IF      TIM_SR_CC7IF_Msk             /*!< CC7IF (Compare 7 interrupt flag) */
/*!< IDXF configuration */
#define TIM_SR_IDXF_Pos   (20U)
#define TIM_SR_IDXF_Msk   (0x1UL << TIM_SR_IDXF_Pos)   /*!< 0x00100000 */
#define TIM_SR_IDXF       TIM_SR_IDXF_Msk              /*!< IDXF (Index interrupt flag) */
/*!< DIRF configuration */
#define TIM_SR_DIRF_Pos   (21U)
#define TIM_SR_DIRF_Msk   (0x1UL << TIM_SR_DIRF_Pos)   /*!< 0x00200000 */
#define TIM_SR_DIRF       TIM_SR_DIRF_Msk              /*!< DIRF (Direction change interrupt flag) */
/*!< IERRF configuration */
#define TIM_SR_IERRF_Pos  (22U)
#define TIM_SR_IERRF_Msk  (0x1UL << TIM_SR_IERRF_Pos)  /*!< 0x00400000 */
#define TIM_SR_IERRF      TIM_SR_IERRF_Msk             /*!< IERRF (Index error interrupt flag) */
/*!< TERRF configuration */
#define TIM_SR_TERRF_Pos  (23U)
#define TIM_SR_TERRF_Msk  (0x1UL << TIM_SR_TERRF_Pos)  /*!< 0x00800000 */
#define TIM_SR_TERRF      TIM_SR_TERRF_Msk             /*!< TERRF (Transition error interrupt flag) */
/*!< UIOVRF configuration */
#define TIM_SR_UIOVRF_Pos (24U)
#define TIM_SR_UIOVRF_Msk (0x1UL << TIM_SR_UIOVRF_Pos) /*!< 0x01000000 */
#define TIM_SR_UIOVRF     TIM_SR_UIOVRF_Msk            /*!< UIOVRF (Update Interrupt Overrun flag) */
/*!< ODS configuration */
#define TIM_SR_ODS_Pos    (25U)
#define TIM_SR_ODS_Msk    (0x1UL << TIM_SR_ODS_Pos)    /*!< 0x02000000 */
#define TIM_SR_ODS        TIM_SR_ODS_Msk               /*!< ODS (Output disable status) */
/*!< TI1FS configuration */
#define TIM_SR_TI1FS_Pos  (28U)
#define TIM_SR_TI1FS_Msk  (0x1UL << TIM_SR_TI1FS_Pos)  /*!< 0x10000000 */
#define TIM_SR_TI1FS      TIM_SR_TI1FS_Msk             /*!< TI1FS (tim_in1f status) */
/*!< TI2FS configuration */
#define TIM_SR_TI2FS_Pos  (29U)
#define TIM_SR_TI2FS_Msk  (0x1UL << TIM_SR_TI2FS_Pos)  /*!< 0x20000000 */
#define TIM_SR_TI2FS      TIM_SR_TI2FS_Msk             /*!< TI2FS (tim_in2f status) */
/*!< TI3FS configuration */
#define TIM_SR_TI3FS_Pos  (30U)
#define TIM_SR_TI3FS_Msk  (0x1UL << TIM_SR_TI3FS_Pos)  /*!< 0x40000000 */
#define TIM_SR_TI3FS      TIM_SR_TI3FS_Msk             /*!< TI3FS (tim_in3f status) */
/*!< TI4FS configuration */
#define TIM_SR_TI4FS_Pos  (31U)
#define TIM_SR_TI4FS_Msk  (0x1UL << TIM_SR_TI4FS_Pos)  /*!< 0x80000000 */
#define TIM_SR_TI4FS      TIM_SR_TI4FS_Msk             /*!< TI4FS (tim_in4f status) */

/********************  Bit definition for TIM_EGR register  ********************/
/*!< UG configuration */
#define TIM_EGR_UG_Pos   (0U)
#define TIM_EGR_UG_Msk   (0x1UL << TIM_EGR_UG_Pos)   /*!< 0x00000001 */
#define TIM_EGR_UG       TIM_EGR_UG_Msk              /*!< UG (Update generation) */
/*!< CC1G configuration */
#define TIM_EGR_CC1G_Pos (1U)
#define TIM_EGR_CC1G_Msk (0x1UL << TIM_EGR_CC1G_Pos) /*!< 0x00000002 */
#define TIM_EGR_CC1G     TIM_EGR_CC1G_Msk            /*!< CC1G (Capture/compare 1  generation) */
/*!< CC2G configuration */
#define TIM_EGR_CC2G_Pos (2U)
#define TIM_EGR_CC2G_Msk (0x1UL << TIM_EGR_CC2G_Pos) /*!< 0x00000004 */
#define TIM_EGR_CC2G     TIM_EGR_CC2G_Msk            /*!< CC2G (Capture/compare 2  generation) */
/*!< CC3G configuration */
#define TIM_EGR_CC3G_Pos (3U)
#define TIM_EGR_CC3G_Msk (0x1UL << TIM_EGR_CC3G_Pos) /*!< 0x00000008 */
#define TIM_EGR_CC3G     TIM_EGR_CC3G_Msk            /*!< CC3G (Capture/compare 3  generation) */
/*!< CC4G configuration */
#define TIM_EGR_CC4G_Pos (4U)
#define TIM_EGR_CC4G_Msk (0x1UL << TIM_EGR_CC4G_Pos) /*!< 0x00000010 */
#define TIM_EGR_CC4G     TIM_EGR_CC4G_Msk            /*!< CC4G (Capture/compare 4  generation) */
/*!< COMG configuration */
#define TIM_EGR_COMG_Pos (5U)
#define TIM_EGR_COMG_Msk (0x1UL << TIM_EGR_COMG_Pos) /*!< 0x00000020 */
#define TIM_EGR_COMG     TIM_EGR_COMG_Msk            /*!< COMG (Capture/compare control update generation) */
/*!< TG configuration */
#define TIM_EGR_TG_Pos   (6U)
#define TIM_EGR_TG_Msk   (0x1UL << TIM_EGR_TG_Pos)   /*!< 0x00000040 */
#define TIM_EGR_TG       TIM_EGR_TG_Msk              /*!< TG (Trigger generation) */
/*!< BG configuration */
#define TIM_EGR_BG_Pos   (7U)
#define TIM_EGR_BG_Msk   (0x1UL << TIM_EGR_BG_Pos)   /*!< 0x00000080 */
#define TIM_EGR_BG       TIM_EGR_BG_Msk              /*!< BG (Break generation) */
/*!< B2G configuration */
#define TIM_EGR_B2G_Pos  (8U)
#define TIM_EGR_B2G_Msk  (0x1UL << TIM_EGR_B2G_Pos)  /*!< 0x00000100 */
#define TIM_EGR_B2G      TIM_EGR_B2G_Msk             /*!< B2G (Break 2 generation) */

