MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/********************  Bit definition for TIM_CCMR1 register  ********************/
/*!< CC1S configuration */
#define TIM_CCMR1_CC1S_Pos   (0U)
#define TIM_CCMR1_CC1S_Msk   (0x3UL << TIM_CCMR1_CC1S_Pos)       /*!< 0x00000003 */
#define TIM_CCMR1_CC1S       TIM_CCMR1_CC1S_Msk                  /*!< CC1S[1:0] bits (Capture/compare 1 selection) */
#define TIM_CCMR1_CC1S_0     (0x1UL << TIM_CCMR1_CC1S_Pos)       /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1     (0x2UL << TIM_CCMR1_CC1S_Pos)       /*!< 0x00000002 */
/*!< IC1PSC configuration */
#define TIM_CCMR1_IC1PSC_Pos (2U)
#define TIM_CCMR1_IC1PSC_Msk (0x3UL << TIM_CCMR1_IC1PSC_Pos)     /*!< 0x0000000C */
#define TIM_CCMR1_IC1PSC     TIM_CCMR1_IC1PSC_Msk                /*!< IC1PSC[1:0] bits (Input capture 1 prescaler) */
#define TIM_CCMR1_IC1PSC_0   (0x1UL << TIM_CCMR1_IC1PSC_Pos)     /*!< 0x00000004 */
#define TIM_CCMR1_IC1PSC_1   (0x2UL << TIM_CCMR1_IC1PSC_Pos)     /*!< 0x00000008 */
/*!< IC1F configuration */
#define TIM_CCMR1_IC1F_Pos   (4U)
#define TIM_CCMR1_IC1F_Msk   (0xFUL << TIM_CCMR1_IC1F_Pos)       /*!< 0x000000F0 */
#define TIM_CCMR1_IC1F       TIM_CCMR1_IC1F_Msk                  /*!< IC1F[3:0] bits (Input capture 1 filter) */
#define TIM_CCMR1_IC1F_0     (0x01UL << TIM_CCMR1_IC1F_Pos)      /*!< 0x00000010 */
#define TIM_CCMR1_IC1F_1     (0x02UL << TIM_CCMR1_IC1F_Pos)      /*!< 0x00000020 */
#define TIM_CCMR1_IC1F_2     (0x04UL << TIM_CCMR1_IC1F_Pos)      /*!< 0x00000040 */
#define TIM_CCMR1_IC1F_3     (0x08UL << TIM_CCMR1_IC1F_Pos)      /*!< 0x00000080 */
/*!< CC2S configuration */
#define TIM_CCMR1_CC2S_Pos   (8U)
#define TIM_CCMR1_CC2S_Msk   (0x3UL << TIM_CCMR1_CC2S_Pos)       /*!< 0x00000300 */
#define TIM_CCMR1_CC2S       TIM_CCMR1_CC2S_Msk                  /*!< CC2S[1:0] bits (Capture/compare 2 selection) */
#define TIM_CCMR1_CC2S_0     (0x1UL << TIM_CCMR1_CC2S_Pos)       /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1     (0x2UL << TIM_CCMR1_CC2S_Pos)       /*!< 0x00000200 */
/*!< IC2PSC configuration */
#define TIM_CCMR1_IC2PSC_Pos (10U)
#define TIM_CCMR1_IC2PSC_Msk (0x3UL << TIM_CCMR1_IC2PSC_Pos)     /*!< 0x00000C00 */
#define TIM_CCMR1_IC2PSC     TIM_CCMR1_IC2PSC_Msk                /*!< IC2PSC[1:0] bits (Input capture 2 prescaler) */
#define TIM_CCMR1_IC2PSC_0   (0x1UL << TIM_CCMR1_IC2PSC_Pos)     /*!< 0x00000400 */
#define TIM_CCMR1_IC2PSC_1   (0x2UL << TIM_CCMR1_IC2PSC_Pos)     /*!< 0x00000800 */
/*!< IC2F configuration */
#define TIM_CCMR1_IC2F_Pos   (12U)
#define TIM_CCMR1_IC2F_Msk   (0xFUL << TIM_CCMR1_IC2F_Pos)       /*!< 0x0000F000 */
#define TIM_CCMR1_IC2F       TIM_CCMR1_IC2F_Msk                  /*!< IC2F[3:0] bits (Input capture 2 filter) */
#define TIM_CCMR1_IC2F_0     (0x01UL << TIM_CCMR1_IC2F_Pos)      /*!< 0x00001000 */
#define TIM_CCMR1_IC2F_1     (0x02UL << TIM_CCMR1_IC2F_Pos)      /*!< 0x00002000 */
#define TIM_CCMR1_IC2F_2     (0x04UL << TIM_CCMR1_IC2F_Pos)      /*!< 0x00004000 */
#define TIM_CCMR1_IC2F_3     (0x08UL << TIM_CCMR1_IC2F_Pos)      /*!< 0x00008000 */

/*-------------------------------------------------------------------------------*/
/*!< OC1FE configuration */
#define TIM_CCMR1_OC1FE_Pos  (2U)
#define TIM_CCMR1_OC1FE_Msk  (0x1UL << TIM_CCMR1_OC1FE_Pos)      /*!< 0x00000004 */
#define TIM_CCMR1_OC1FE      TIM_CCMR1_OC1FE_Msk                 /*!< OC1FE (Output compare 1 fast enable) */
/*!< OC1PE configuration */
#define TIM_CCMR1_OC1PE_Pos  (3U)
#define TIM_CCMR1_OC1PE_Msk  (0x1UL << TIM_CCMR1_OC1PE_Pos)      /*!< 0x00000008 */
#define TIM_CCMR1_OC1PE      TIM_CCMR1_OC1PE_Msk                 /*!< OC1PE (Output compare 1 preload enable) */
/*!< OC1M configuration */
#define TIM_CCMR1_OC1M_Pos   (4U)
#define TIM_CCMR1_OC1M_Msk   (0x3007UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00030070 */
#define TIM_CCMR1_OC1M       TIM_CCMR1_OC1M_Msk                  /*!< OC1M[2:0] bits (Output compare 1 mode) */
#define TIM_CCMR1_OC1M_0     (0x0001UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00000010 */
#define TIM_CCMR1_OC1M_1     (0x0002UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00000020 */
#define TIM_CCMR1_OC1M_2     (0x0004UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00000040 */
#define TIM_CCMR1_OC1M_3     (0x1000UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00010000 */
#define TIM_CCMR1_OC1M_4     (0x2000UL << TIM_CCMR1_OC1M_Pos)    /*!< 0x00020000 */
/*!< OC1CE configuration */
#define TIM_CCMR1_OC1CE_Pos  (7U)
#define TIM_CCMR1_OC1CE_Msk  (0x1UL << TIM_CCMR1_OC1CE_Pos)      /*!< 0x00000080 */
#define TIM_CCMR1_OC1CE      TIM_CCMR1_OC1CE_Msk                 /*!< OC1CE (Output compare 1 clear enable) */
/*!< OC2FE configuration */
#define TIM_CCMR1_OC2FE_Pos  (10U)
#define TIM_CCMR1_OC2FE_Msk  (0x1UL << TIM_CCMR1_OC2FE_Pos)      /*!< 0x00000400 */
#define TIM_CCMR1_OC2FE      TIM_CCMR1_OC2FE_Msk                 /*!< OC2FE (Output compare 2 fast enable) */
/*!< OC2PE configuration */
#define TIM_CCMR1_OC2PE_Pos  (11U)
#define TIM_CCMR1_OC2PE_Msk  (0x1UL << TIM_CCMR1_OC2PE_Pos)      /*!< 0x00000800 */
#define TIM_CCMR1_OC2PE      TIM_CCMR1_OC2PE_Msk                 /*!< OC2PE (Output compare 2 preload enable) */
/*!< OC2M configuration */
#define TIM_CCMR1_OC2M_Pos   (12U)
#define TIM_CCMR1_OC2M_Msk   (0x3007UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x03007000 */
#define TIM_CCMR1_OC2M       TIM_CCMR1_OC2M_Msk                  /*!< OC2M[2:0] bits (Output compare 2 mode) */
#define TIM_CCMR1_OC2M_0     (0x0001UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x00001000 */
#define TIM_CCMR1_OC2M_1     (0x0002UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x00002000 */
#define TIM_CCMR1_OC2M_2     (0x0004UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x00004000 */
#define TIM_CCMR1_OC2M_3     (0x1000UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x01000000 */
#define TIM_CCMR1_OC2M_4     (0x2000UL << TIM_CCMR1_OC2M_Pos)    /*!< 0x02000000 */
/*!< OC2CE configuration */
#define TIM_CCMR1_OC2CE_Pos  (15U)
#define TIM_CCMR1_OC2CE_Msk  (0x1UL << TIM_CCMR1_OC2CE_Pos)      /*!< 0x00008000 */
#define TIM_CCMR1_OC2CE      TIM_CCMR1_OC2CE_Msk                 /*!< OC2CE (Output compare 2 clear enable) */

/********************  Bit definition for TIM_CCMR2 register  ********************/
/*!< CC3S configuration */
#define TIM_CCMR2_CC3S_Pos   (0U)
#define TIM_CCMR2_CC3S_Msk   (0x3UL << TIM_CCMR2_CC3S_Pos)       /*!< 0x00000003 */
#define TIM_CCMR2_CC3S       TIM_CCMR2_CC3S_Msk                  /*!< CC3S[1:0] bits (Capture/compare 3 selection) */
#define TIM_CCMR2_CC3S_0     (0x1UL << TIM_CCMR2_CC3S_Pos)       /*!< 0x00000001 */
#define TIM_CCMR2_CC3S_1     (0x2UL << TIM_CCMR2_CC3S_Pos)       /*!< 0x00000002 */
/*!< IC3PSC configuration */
#define TIM_CCMR2_IC3PSC_Pos (2U)
#define TIM_CCMR2_IC3PSC_Msk (0x3UL << TIM_CCMR2_IC3PSC_Pos)     /*!< 0x0000000C */
#define TIM_CCMR2_IC3PSC     TIM_CCMR2_IC3PSC_Msk                /*!< IC3PSC[1:0] bits (Input capture 3 prescaler) */
#define TIM_CCMR2_IC3PSC_0   (0x1UL << TIM_CCMR2_IC3PSC_Pos)     /*!< 0x00000004 */
#define TIM_CCMR2_IC3PSC_1   (0x2UL << TIM_CCMR2_IC3PSC_Pos)     /*!< 0x00000008 */
/*!< IC3F configuration */
#define TIM_CCMR2_IC3F_Pos   (4U)
#define TIM_CCMR2_IC3F_Msk   (0xFUL << TIM_CCMR2_IC3F_Pos)       /*!< 0x000000F0 */
#define TIM_CCMR2_IC3F       TIM_CCMR2_IC3F_Msk                  /*!< IC3F[3:0] bits (Input capture 3 filter) */
#define TIM_CCMR2_IC3F_0     (0x01UL << TIM_CCMR2_IC3F_Pos)      /*!< 0x00000010 */
#define TIM_CCMR2_IC3F_1     (0x02UL << TIM_CCMR2_IC3F_Pos)      /*!< 0x00000020 */
#define TIM_CCMR2_IC3F_2     (0x04UL << TIM_CCMR2_IC3F_Pos)      /*!< 0x00000040 */
#define TIM_CCMR2_IC3F_3     (0x08UL << TIM_CCMR2_IC3F_Pos)      /*!< 0x00000080 */
/*!< IC4PSC configuration */
#define TIM_CCMR2_IC4PSC_Pos (10U)
#define TIM_CCMR2_IC4PSC_Msk (0x3UL << TIM_CCMR2_IC4PSC_Pos)     /*!< 0x00000C00 */
#define TIM_CCMR2_IC4PSC     TIM_CCMR2_IC4PSC_Msk                /*!< IC4PSC[1:0] bits (Input capture 4 prescaler) */
#define TIM_CCMR2_IC4PSC_0   (0x1UL << TIM_CCMR2_IC4PSC_Pos)     /*!< 0x00000400 */
#define TIM_CCMR2_IC4PSC_1   (0x2UL << TIM_CCMR2_IC4PSC_Pos)     /*!< 0x00000800 */
/*!< IC4F configuration */
#define TIM_CCMR2_IC4F_Pos   (12U)
#define TIM_CCMR2_IC4F_Msk   (0xFUL << TIM_CCMR2_IC4F_Pos)       /*!< 0x0000F000 */
#define TIM_CCMR2_IC4F       TIM_CCMR2_IC4F_Msk                  /*!< IC4F[3:0] bits (Input capture 4 filter) */
#define TIM_CCMR2_IC4F_0     (0x01UL << TIM_CCMR2_IC4F_Pos)      /*!< 0x00001000 */
#define TIM_CCMR2_IC4F_1     (0x02UL << TIM_CCMR2_IC4F_Pos)      /*!< 0x00002000 */
#define TIM_CCMR2_IC4F_2     (0x04UL << TIM_CCMR2_IC4F_Pos)      /*!< 0x00004000 */
#define TIM_CCMR2_IC4F_3     (0x08UL << TIM_CCMR2_IC4F_Pos)      /*!< 0x00008000 */

/*-------------------------------------------------------------------------------*/
/*!< OC3FE configuration */
#define TIM_CCMR2_OC3FE_Pos  (2U)
#define TIM_CCMR2_OC3FE_Msk  (0x1UL << TIM_CCMR2_OC3FE_Pos)      /*!< 0x00000004 */
#define TIM_CCMR2_OC3FE      TIM_CCMR2_OC3FE_Msk                 /*!< OC3FE (Output compare 3 fast enable) */
/*!< OC3PE configuration */
#define TIM_CCMR2_OC3PE_Pos  (3U)
#define TIM_CCMR2_OC3PE_Msk  (0x1UL << TIM_CCMR2_OC3PE_Pos)      /*!< 0x00000008 */
#define TIM_CCMR2_OC3PE      TIM_CCMR2_OC3PE_Msk                 /*!< OC3PE (Output compare 3 preload enable) */
/*!< OC3M configuration */
#define TIM_CCMR2_OC3M_Pos   (4U)
#define TIM_CCMR2_OC3M_Msk   (0x3007UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00030070 */
#define TIM_CCMR2_OC3M       TIM_CCMR2_OC3M_Msk                  /*!< OC3M[2:0] bits (Output compare 3 mode) */
#define TIM_CCMR2_OC3M_0     (0x0001UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00000010 */
#define TIM_CCMR2_OC3M_1     (0x0002UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00000020 */
#define TIM_CCMR2_OC3M_2     (0x0004UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00000040 */
#define TIM_CCMR2_OC3M_3     (0x1000UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00010000 */
#define TIM_CCMR2_OC3M_4     (0x2000UL << TIM_CCMR2_OC3M_Pos)    /*!< 0x00020000 */
/*!< OC3CE configuration */
#define TIM_CCMR2_OC3CE_Pos  (7U)
#define TIM_CCMR2_OC3CE_Msk  (0x1UL << TIM_CCMR2_OC3CE_Pos)      /*!< 0x00000080 */
#define TIM_CCMR2_OC3CE      TIM_CCMR2_OC3CE_Msk                 /*!< OC3CE (Output compare 3 clear enable) */
/*!< CC4S configuration */
#define TIM_CCMR2_CC4S_Pos   (8U)
#define TIM_CCMR2_CC4S_Msk   (0x3UL << TIM_CCMR2_CC4S_Pos)       /*!< 0x00000300 */
#define TIM_CCMR2_CC4S       TIM_CCMR2_CC4S_Msk                  /*!< CC4S[1:0] bits (Capture/compare 4 selection) */
#define TIM_CCMR2_CC4S_0     (0x1UL << TIM_CCMR2_CC4S_Pos)       /*!< 0x00000100 */
#define TIM_CCMR2_CC4S_1     (0x2UL << TIM_CCMR2_CC4S_Pos)       /*!< 0x00000200 */
/*!< OC4FE configuration */
#define TIM_CCMR2_OC4FE_Pos  (10U)
#define TIM_CCMR2_OC4FE_Msk  (0x1UL << TIM_CCMR2_OC4FE_Pos)      /*!< 0x00000400 */
#define TIM_CCMR2_OC4FE      TIM_CCMR2_OC4FE_Msk                 /*!< OC4FE (Output compare 4 fast enable) */
/*!< OC4PE configuration */
#define TIM_CCMR2_OC4PE_Pos  (11U)
#define TIM_CCMR2_OC4PE_Msk  (0x1UL << TIM_CCMR2_OC4PE_Pos)      /*!< 0x00000800 */
#define TIM_CCMR2_OC4PE      TIM_CCMR2_OC4PE_Msk                 /*!< OC4PE (Output compare 4 preload enable) */
/*!< OC4M configuration */
#define TIM_CCMR2_OC4M_Pos   (12U)
#define TIM_CCMR2_OC4M_Msk   (0x3007UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x03007000 */
#define TIM_CCMR2_OC4M       TIM_CCMR2_OC4M_Msk                  /*!< OC4M[2:0] bits (Output compare 4 mode) */
#define TIM_CCMR2_OC4M_0     (0x0001UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x00001000 */
#define TIM_CCMR2_OC4M_1     (0x0002UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x00002000 */
#define TIM_CCMR2_OC4M_2     (0x0004UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x00004000 */
#define TIM_CCMR2_OC4M_3     (0x1000UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x01000000 */
#define TIM_CCMR2_OC4M_4     (0x2000UL << TIM_CCMR2_OC4M_Pos)    /*!< 0x02000000 */
/*!< OC4CE configuration */
#define TIM_CCMR2_OC4CE_Pos  (15U)
#define TIM_CCMR2_OC4CE_Msk  (0x1UL << TIM_CCMR2_OC4CE_Pos)      /*!< 0x00008000 */
#define TIM_CCMR2_OC4CE      TIM_CCMR2_OC4CE_Msk                 /*!< OC4CE (Output compare 4 clear enable) */

/********************  Bit definition for TIM_CCER register  ********************/
/*!< CC1E configuration */
#define TIM_CCER_CC1E_Pos  (0U)
#define TIM_CCER_CC1E_Msk  (0x1UL << TIM_CCER_CC1E_Pos)  /*!< 0x00000001 */
#define TIM_CCER_CC1E      TIM_CCER_CC1E_Msk             /*!< CC1E (Capture/compare  1 output enable) */
/*!< CC1P configuration */
#define TIM_CCER_CC1P_Pos  (1U)
#define TIM_CCER_CC1P_Msk  (0x1UL << TIM_CCER_CC1P_Pos)  /*!< 0x00000002 */
#define TIM_CCER_CC1P      TIM_CCER_CC1P_Msk             /*!< CC1P (Capture/compare 1 output polarity) */
/*!< CC1NE configuration */
#define TIM_CCER_CC1NE_Pos (2U)
#define TIM_CCER_CC1NE_Msk (0x1UL << TIM_CCER_CC1NE_Pos) /*!< 0x00000004 */
#define TIM_CCER_CC1NE     TIM_CCER_CC1NE_Msk            /*!< CC1NE (Capture/compare 1 complementary output enable) */
/*!< CC1NP configuration */
#define TIM_CCER_CC1NP_Pos (3U)
#define TIM_CCER_CC1NP_Msk (0x1UL << TIM_CCER_CC1NP_Pos) /*!< 0x00000008 */
#define TIM_CCER_CC1NP     TIM_CCER_CC1NP_Msk            /*!< CC1NP (Capture/compare 1 complementary output polarity) */
/*!< CC2E configuration */
#define TIM_CCER_CC2E_Pos  (4U)
#define TIM_CCER_CC2E_Msk  (0x1UL << TIM_CCER_CC2E_Pos)  /*!< 0x00000010 */
#define TIM_CCER_CC2E      TIM_CCER_CC2E_Msk             /*!< CC2E (Capture/compare  2 output enable) */
/*!< CC2P configuration */
#define TIM_CCER_CC2P_Pos  (5U)
#define TIM_CCER_CC2P_Msk  (0x1UL << TIM_CCER_CC2P_Pos)  /*!< 0x00000020 */
#define TIM_CCER_CC2P      TIM_CCER_CC2P_Msk             /*!< CC2P (Capture/compare 2 output polarity) */
/*!< CC2NE configuration */
#define TIM_CCER_CC2NE_Pos (6U)
#define TIM_CCER_CC2NE_Msk (0x1UL << TIM_CCER_CC2NE_Pos) /*!< 0x00000040 */
#define TIM_CCER_CC2NE     TIM_CCER_CC2NE_Msk            /*!< CC2NE (Capture/compare 2 complementary output enable) */
/*!< CC2NP configuration */
#define TIM_CCER_CC2NP_Pos (7U)
#define TIM_CCER_CC2NP_Msk (0x1UL << TIM_CCER_CC2NP_Pos) /*!< 0x00000080 */
#define TIM_CCER_CC2NP     TIM_CCER_CC2NP_Msk            /*!< CC2NP (Capture/compare 2 complementary output polarity) */
/*!< CC3E configuration */
#define TIM_CCER_CC3E_Pos  (8U)
#define TIM_CCER_CC3E_Msk  (0x1UL << TIM_CCER_CC3E_Pos)  /*!< 0x00000100 */
#define TIM_CCER_CC3E      TIM_CCER_CC3E_Msk             /*!< CC3E (Capture/compare  3 output enable) */
/*!< CC3P configuration */
#define TIM_CCER_CC3P_Pos  (9U)
#define TIM_CCER_CC3P_Msk  (0x1UL << TIM_CCER_CC3P_Pos)  /*!< 0x00000200 */
#define TIM_CCER_CC3P      TIM_CCER_CC3P_Msk             /*!< CC3P (Capture/compare 3 output polarity) */
/*!< CC3NE configuration */
#define TIM_CCER_CC3NE_Pos (10U)
#define TIM_CCER_CC3NE_Msk (0x1UL << TIM_CCER_CC3NE_Pos) /*!< 0x00000400 */
#define TIM_CCER_CC3NE     TIM_CCER_CC3NE_Msk            /*!< CC3NE (Capture/compare 3 complementary output enable) */
/*!< CC3NP configuration */
#define TIM_CCER_CC3NP_Pos (11U)
#define TIM_CCER_CC3NP_Msk (0x1UL << TIM_CCER_CC3NP_Pos) /*!< 0x00000800 */
#define TIM_CCER_CC3NP     TIM_CCER_CC3NP_Msk            /*!< CC3NP (Capture/compare 3 complementary output polarity) */
/*!< CC4E configuration */
#define TIM_CCER_CC4E_Pos  (12U)
#define TIM_CCER_CC4E_Msk  (0x1UL << TIM_CCER_CC4E_Pos)  /*!< 0x00001000 */
#define TIM_CCER_CC4E      TIM_CCER_CC4E_Msk             /*!< CC4E (Capture/compare  4 output enable) */
/*!< CC4P configuration */
#define TIM_CCER_CC4P_Pos  (13U)
#define TIM_CCER_CC4P_Msk  (0x1UL << TIM_CCER_CC4P_Pos)  /*!< 0x00002000 */
#define TIM_CCER_CC4P      TIM_CCER_CC4P_Msk             /*!< CC4P (Capture/compare 4 output polarity) */
/*!< CC4NE configuration */
#define TIM_CCER_CC4NE_Pos (14U)
#define TIM_CCER_CC4NE_Msk (0x1UL << TIM_CCER_CC4NE_Pos) /*!< 0x00004000 */
#define TIM_CCER_CC4NE     TIM_CCER_CC4NE_Msk            /*!< CC4NE (Capture/compare 4 complementary output enable) */
/*!< CC4NP configuration */
#define TIM_CCER_CC4NP_Pos (15U)
#define TIM_CCER_CC4NP_Msk (0x1UL << TIM_CCER_CC4NP_Pos) /*!< 0x00008000 */
#define TIM_CCER_CC4NP     TIM_CCER_CC4NP_Msk            /*!< CC4NP (Capture/compare 4 complementary output polarity) */
/*!< CC5E configuration */
#define TIM_CCER_CC5E_Pos  (16U)
#define TIM_CCER_CC5E_Msk  (0x1UL << TIM_CCER_CC5E_Pos)  /*!< 0x00010000 */
#define TIM_CCER_CC5E      TIM_CCER_CC5E_Msk             /*!< CC5E (Capture/compare  5 output enable) */
/*!< CC5P configuration */
#define TIM_CCER_CC5P_Pos  (17U)
#define TIM_CCER_CC5P_Msk  (0x1UL << TIM_CCER_CC5P_Pos)  /*!< 0x00020000 */
#define TIM_CCER_CC5P      TIM_CCER_CC5P_Msk             /*!< CC5P (Capture/compare 5 output polarity) */
/*!< CC6E configuration */
#define TIM_CCER_CC6E_Pos  (20U)
#define TIM_CCER_CC6E_Msk  (0x1UL << TIM_CCER_CC6E_Pos)  /*!< 0x00100000 */
#define TIM_CCER_CC6E      TIM_CCER_CC6E_Msk             /*!< CC6E (Capture/compare  6 output enable) */
/*!< CC6P configuration */
#define TIM_CCER_CC6P_Pos  (21U)
#define TIM_CCER_CC6P_Msk  (0x1UL << TIM_CCER_CC6P_Pos)  /*!< 0x00200000 */
#define TIM_CCER_CC6P      TIM_CCER_CC6P_Msk             /*!< CC6P (Capture/compare 6 output polarity) */
/*!< CC7E configuration */
#define TIM_CCER_CC7E_Pos  (24U)
#define TIM_CCER_CC7E_Msk  (0x1UL << TIM_CCER_CC7E_Pos)  /*!< 0x01000000 */
#define TIM_CCER_CC7E      TIM_CCER_CC7E_Msk             /*!< CC7E (Capture/compare  7 output enable) */
/*!< CC7P configuration */
#define TIM_CCER_CC7P_Pos  (25U)
#define TIM_CCER_CC7P_Msk  (0x1UL << TIM_CCER_CC7P_Pos)  /*!< 0x02000000 */
#define TIM_CCER_CC7P      TIM_CCER_CC7P_Msk             /*!< CC7P (Capture/compare 7 output polarity) */

