MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/********************  Bit definition for TIM_CCR5 register  ********************/
/*!< CCR5 configuration */
#define TIM_CCR5_CCR5_Pos   (0U)
#define TIM_CCR5_CCR5_Msk   (0x000FFFFFUL << TIM_CCR5_CCR5_Pos) /*!< 0x000FFFFF */
#define TIM_CCR5_CCR5       TIM_CCR5_CCR5_Msk                   /*!< CCR5[19:0] bits (Capture/compare 5 value) */
/*!< GC5C1O configuration */
#define TIM_CCR5_GC5C1O_Pos (24U)
#define TIM_CCR5_GC5C1O_Msk (0x1UL << TIM_CCR5_GC5C1O_Pos)      /*!< 0x01000000 */
#define TIM_CCR5_GC5C1O     TIM_CCR5_GC5C1O_Msk                 /*!< GC5C1O (Group channel 5 and channel 1 (ORed)) */
/*!< GC5C2O configuration */
#define TIM_CCR5_GC5C2O_Pos (25U)
#define TIM_CCR5_GC5C2O_Msk (0x1UL << TIM_CCR5_GC5C2O_Pos)      /*!< 0x02000000 */
#define TIM_CCR5_GC5C2O     TIM_CCR5_GC5C2O_Msk                 /*!< GC5C2O (Group channel 5 and channel 2 (ORed)) */
/*!< GC5C3O configuration */
#define TIM_CCR5_GC5C3O_Pos (26U)
#define TIM_CCR5_GC5C3O_Msk (0x1UL << TIM_CCR5_GC5C3O_Pos)      /*!< 0x04000000 */
#define TIM_CCR5_GC5C3O     TIM_CCR5_GC5C3O_Msk                 /*!< GC5C3O (Group channel 5 and channel 3 (ORed)) */
/*!< GC5C4O configuration */
#define TIM_CCR5_GC5C4O_Pos (27U)
#define TIM_CCR5_GC5C4O_Msk (0x1UL << TIM_CCR5_GC5C4O_Pos)      /*!< 0x08000000 */
#define TIM_CCR5_GC5C4O     TIM_CCR5_GC5C4O_Msk                 /*!< GC5C4O (Group channel 5 and channel 4 (ORed)) */
/*!< GC5C4 configuration */
#define TIM_CCR5_GC5C4_Pos  (28U)
#define TIM_CCR5_GC5C4_Msk  (0x1UL << TIM_CCR5_GC5C4_Pos)       /*!< 0x10000000 */
#define TIM_CCR5_GC5C4      TIM_CCR5_GC5C4_Msk                  /*!< GC5C4 (Group channel 5 and channel 4) */
/*!< GC5C1 configuration */
#define TIM_CCR5_GC5C1_Pos  (29U)
#define TIM_CCR5_GC5C1_Msk  (0x1UL << TIM_CCR5_GC5C1_Pos)       /*!< 0x20000000 */
#define TIM_CCR5_GC5C1      TIM_CCR5_GC5C1_Msk                  /*!< GC5C1 (Group channel 5 and channel 1) */
/*!< GC5C2 configuration */
#define TIM_CCR5_GC5C2_Pos  (30U)
#define TIM_CCR5_GC5C2_Msk  (0x1UL << TIM_CCR5_GC5C2_Pos)       /*!< 0x40000000 */
#define TIM_CCR5_GC5C2      TIM_CCR5_GC5C2_Msk                  /*!< GC5C2 (Group channel 5 and channel 2) */
/*!< GC5C3 configuration */
#define TIM_CCR5_GC5C3_Pos  (31U)
#define TIM_CCR5_GC5C3_Msk  (0x1UL << TIM_CCR5_GC5C3_Pos)       /*!< 0x80000000 */
#define TIM_CCR5_GC5C3      TIM_CCR5_GC5C3_Msk                  /*!< GC5C3 (Group channel 5 and channel 3) */

/********************  Bit definition for TIM_CCR6 register  ********************/
/*!< CCR6 configuration */
#define TIM_CCR6_CCR6_Pos    (0U)
#define TIM_CCR6_CCR6_Msk    (0x000FFFFFUL << TIM_CCR6_CCR6_Pos) /*!< 0x000FFFFF */
#define TIM_CCR6_CCR6        TIM_CCR6_CCR6_Msk                   /*!< CCR6[19:0] bits (Capture/compare 6 value) */

/********************  Bit definition for TIM_CCMR3 register  ********************/
/*!< OC5FE configuration */
#define TIM_CCMR3_OC5FE_Pos  (2U)
#define TIM_CCMR3_OC5FE_Msk  (0x1UL << TIM_CCMR3_OC5FE_Pos)      /*!< 0x00000004 */
#define TIM_CCMR3_OC5FE      TIM_CCMR3_OC5FE_Msk                 /*!< OC5FE (Output compare 5 fast enable) */
/*!< OC5PE configuration */
#define TIM_CCMR3_OC5PE_Pos  (3U)
#define TIM_CCMR3_OC5PE_Msk  (0x1UL << TIM_CCMR3_OC5PE_Pos)      /*!< 0x00000008 */
#define TIM_CCMR3_OC5PE      TIM_CCMR3_OC5PE_Msk                 /*!< OC5PE (Output compare 5 preload enable) */
/*!< OC5M configuration */
#define TIM_CCMR3_OC5M_Pos   (4U)
#define TIM_CCMR3_OC5M_Msk   (0x3007UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00030070 */
#define TIM_CCMR3_OC5M       TIM_CCMR3_OC5M_Msk                  /*!< OC5M[2:0] bits (Output compare 5 mode) */
#define TIM_CCMR3_OC5M_0     (0x0001UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000010 */
#define TIM_CCMR3_OC5M_1     (0x0002UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000020 */
#define TIM_CCMR3_OC5M_2     (0x0004UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000040 */
#define TIM_CCMR3_OC5M_3     (0x1000UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00010000 */
#define TIM_CCMR3_OC5M_4     (0x2000UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00020000 */
/*!< OC5CE configuration */
#define TIM_CCMR3_OC5CE_Pos  (7U)
#define TIM_CCMR3_OC5CE_Msk  (0x1UL << TIM_CCMR3_OC5CE_Pos)      /*!< 0x00000080 */
#define TIM_CCMR3_OC5CE      TIM_CCMR3_OC5CE_Msk                 /*!< OC5CE (Output compare 5 clear enable) */
/*!< OC6FE configuration */
#define TIM_CCMR3_OC6FE_Pos  (10U)
#define TIM_CCMR3_OC6FE_Msk  (0x1UL << TIM_CCMR3_OC6FE_Pos)      /*!< 0x00000400 */
#define TIM_CCMR3_OC6FE      TIM_CCMR3_OC6FE_Msk                 /*!< OC6FE (Output compare 6 fast enable) */
/*!< OC6PE configuration */
#define TIM_CCMR3_OC6PE_Pos  (11U)
#define TIM_CCMR3_OC6PE_Msk  (0x1UL << TIM_CCMR3_OC6PE_Pos)      /*!< 0x00000800 */
#define TIM_CCMR3_OC6PE      TIM_CCMR3_OC6PE_Msk                 /*!< OC6PE (Output compare 6 preload enable) */
/*!< OC6M configuration */
#define TIM_CCMR3_OC6M_Pos   (12U)
#define TIM_CCMR3_OC6M_Msk   (0x3007UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x03007000 */
#define TIM_CCMR3_OC6M       TIM_CCMR3_OC6M_Msk                  /*!< OC6M[2:0] bits (Output compare 6 mode) */
#define TIM_CCMR3_OC6M_0     (0x0001UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00001000 */
#define TIM_CCMR3_OC6M_1     (0x0002UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00002000 */
#define TIM_CCMR3_OC6M_2     (0x0004UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00004000 */
#define TIM_CCMR3_OC6M_3     (0x1000UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x01000000 */
#define TIM_CCMR3_OC6M_4     (0x2000UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x02000000 */
/*!< OC6CE configuration */
#define TIM_CCMR3_OC6CE_Pos  (15U)
#define TIM_CCMR3_OC6CE_Msk  (0x1UL << TIM_CCMR3_OC6CE_Pos)      /*!< 0x00008000 */
#define TIM_CCMR3_OC6CE      TIM_CCMR3_OC6CE_Msk                 /*!< OC6CE (Output compare 6 clear enable) */

/********************  Bit definition for TIM_DTR2 register  ********************/
/*!< DTGF configuration */
#define TIM_DTR2_DTGF_Pos     (0U)
#define TIM_DTR2_DTGF_Msk     (0xFFUL << TIM_DTR2_DTGF_Pos)  /*!< 0x000000FF */
#define TIM_DTR2_DTGF         TIM_DTR2_DTGF_Msk              /*!< DTGF[7:0] bits (Dead-time falling edge generator setup) */
#define TIM_DTR2_DTGF_0       (0x001UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000001 */
#define TIM_DTR2_DTGF_1       (0x002UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000002 */
#define TIM_DTR2_DTGF_2       (0x004UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000004 */
#define TIM_DTR2_DTGF_3       (0x008UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000008 */
#define TIM_DTR2_DTGF_4       (0x010UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000010 */
#define TIM_DTR2_DTGF_5       (0x020UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000020 */
#define TIM_DTR2_DTGF_6       (0x040UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000040 */
#define TIM_DTR2_DTGF_7       (0x080UL << TIM_DTR2_DTGF_Pos) /*!< 0x00000080 */
/*!< DTAE configuration */
#define TIM_DTR2_DTAE_Pos     (16U)
#define TIM_DTR2_DTAE_Msk     (0x1UL << TIM_DTR2_DTAE_Pos)   /*!< 0x00010000 */
#define TIM_DTR2_DTAE         TIM_DTR2_DTAE_Msk              /*!< DTAE (Deadtime asymmetric enable) */
/*!< DTPE configuration */
#define TIM_DTR2_DTPE_Pos     (17U)
#define TIM_DTR2_DTPE_Msk     (0x1UL << TIM_DTR2_DTPE_Pos)   /*!< 0x00020000 */
#define TIM_DTR2_DTPE         TIM_DTR2_DTPE_Msk              /*!< DTPE (Deadtime preload enable) */

/********************  Bit definition for TIM_ECR register  ********************/
/*!< IE configuration */
#define TIM_ECR_IE_Pos        (0U)
#define TIM_ECR_IE_Msk        (0x1UL << TIM_ECR_IE_Pos)     /*!< 0x00000001 */
#define TIM_ECR_IE            TIM_ECR_IE_Msk                /*!< IE (Index enable) */
/*!< IDIR configuration */
#define TIM_ECR_IDIR_Pos      (1U)
#define TIM_ECR_IDIR_Msk      (0x3UL << TIM_ECR_IDIR_Pos)   /*!< 0x00000006 */
#define TIM_ECR_IDIR          TIM_ECR_IDIR_Msk              /*!< IDIR[1:0] bits (Index direction) */
#define TIM_ECR_IDIR_0        (0x1UL << TIM_ECR_IDIR_Pos)   /*!< 0x00000002 */
#define TIM_ECR_IDIR_1        (0x2UL << TIM_ECR_IDIR_Pos)   /*!< 0x00000004 */
/*!< IBLK configuration */
#define TIM_ECR_IBLK_Pos      (3U)
#define TIM_ECR_IBLK_Msk      (0x3UL << TIM_ECR_IBLK_Pos)   /*!< 0x00000018 */
#define TIM_ECR_IBLK          TIM_ECR_IBLK_Msk              /*!< IBLK[1:0] bits (Index blanking) */
#define TIM_ECR_IBLK_0        (0x1UL << TIM_ECR_IBLK_Pos)   /*!< 0x00000008 */
#define TIM_ECR_IBLK_1        (0x2UL << TIM_ECR_IBLK_Pos)   /*!< 0x00000010 */
/*!< FIDX configuration */
#define TIM_ECR_FIDX_Pos      (5U)
#define TIM_ECR_FIDX_Msk      (0x1UL << TIM_ECR_FIDX_Pos)   /*!< 0x00000020 */
#define TIM_ECR_FIDX          TIM_ECR_FIDX_Msk              /*!< FIDX (First index) */
/*!< IPOS configuration */
#define TIM_ECR_IPOS_Pos      (6U)
#define TIM_ECR_IPOS_Msk      (0x3UL << TIM_ECR_IPOS_Pos)   /*!< 0x000000C0 */
#define TIM_ECR_IPOS          TIM_ECR_IPOS_Msk              /*!< IPOS[1:0] bits (Index positioning) */
#define TIM_ECR_IPOS_0        (0x1UL << TIM_ECR_IPOS_Pos)   /*!< 0x00000040 */
#define TIM_ECR_IPOS_1        (0x2UL << TIM_ECR_IPOS_Pos)   /*!< 0x00000080 */
/*!< PW configuration */
#define TIM_ECR_PW_Pos        (16U)
#define TIM_ECR_PW_Msk        (0xFFUL << TIM_ECR_PW_Pos)    /*!< 0x00FF0000 */
#define TIM_ECR_PW            TIM_ECR_PW_Msk                /*!< PW[7:0] bits (Pulse width) */
#define TIM_ECR_PW_0          (0x001UL << TIM_ECR_PW_Pos)   /*!< 0x00010000 */
#define TIM_ECR_PW_1          (0x002UL << TIM_ECR_PW_Pos)   /*!< 0x00020000 */
#define TIM_ECR_PW_2          (0x004UL << TIM_ECR_PW_Pos)   /*!< 0x00040000 */
#define TIM_ECR_PW_3          (0x008UL << TIM_ECR_PW_Pos)   /*!< 0x00080000 */
#define TIM_ECR_PW_4          (0x010UL << TIM_ECR_PW_Pos)   /*!< 0x00100000 */
#define TIM_ECR_PW_5          (0x020UL << TIM_ECR_PW_Pos)   /*!< 0x00200000 */
#define TIM_ECR_PW_6          (0x040UL << TIM_ECR_PW_Pos)   /*!< 0x00400000 */
#define TIM_ECR_PW_7          (0x080UL << TIM_ECR_PW_Pos)   /*!< 0x00800000 */
/*!< PWPRSC configuration */
#define TIM_ECR_PWPRSC_Pos    (24U)
#define TIM_ECR_PWPRSC_Msk    (0x7UL << TIM_ECR_PWPRSC_Pos) /*!< 0x07000000 */
#define TIM_ECR_PWPRSC        TIM_ECR_PWPRSC_Msk            /*!< PWPRSC[2:0] bits (Pulse width prescaler) */
#define TIM_ECR_PWPRSC_0      (0x1UL << TIM_ECR_PWPRSC_Pos) /*!< 0x01000000 */
#define TIM_ECR_PWPRSC_1      (0x2UL << TIM_ECR_PWPRSC_Pos) /*!< 0x02000000 */
#define TIM_ECR_PWPRSC_2      (0x4UL << TIM_ECR_PWPRSC_Pos) /*!< 0x04000000 */

