MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c542xx.h
/**************************** HASH Instances ********************************/
#define IS_HASH_ALL_INSTANCE(INSTANCE) ((INSTANCE) == HASH)

/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1))
/****************** I2C Instances : wakeup capability from stop modes *********/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/******************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1))

/******************************** I3C Instances *******************************/
#define IS_I3C_ALL_INSTANCE(INSTANCE)   (((INSTANCE) == I3C1))

/****************************** ICACHE Instances ******************************/
#define IS_ICACHE_ALL_INSTANCE(INSTANCE)    (((INSTANCE) == ICACHE))

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == IWDG))

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    (((INSTANCE) == LPUART1))

/****************************** OPAMP Instances ********************************/
#define IS_OPAMP_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == OPAMP1)

/* *************************************************** RAMCFG Instances ********************************************* */
#define IS_RAMCFG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1)  || ((INSTANCE) == RAMCFG_SRAM2))

/* ********************************************* RAMCFG Mass Erase Instances **************************************** */
#define IS_RAMCFG_MASS_ERASE_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1)  || ((INSTANCE) == RAMCFG_SRAM2))

/* ********************************************* RAMCFG ECC Instances *********************************************** */
#define IS_RAMCFG_ECC_INSTANCE(INSTANCE) ((INSTANCE) == RAMCFG_SRAM2)

/* ****************************************** RAMCFG Write Protection Instances ************************************* */
#define IS_RAMCFG_WP_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1)  || ((INSTANCE) == RAMCFG_SRAM2))

/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RNG)

/******************************* RTC Instances ********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)   ((INSTANCE) == RTC)

/******************************** LPTIM Instances *****************************/
#define IS_LPTIM_INSTANCE(INSTANCE)     ((INSTANCE) == LPTIM1)

/****************** LPTIM Instances : DMA supported instances *****************/
#define IS_LPTIM_DMA_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1)

/************* LPTIM Instances : at least 1 capture/compare channel ***********/
#define IS_LPTIM_CC1_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1)

/************* LPTIM Instances : at least 2 capture/compare channel ***********/
#define IS_LPTIM_CC2_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1)

/****************** LPTIM Instances : supporting encoder interface ************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1)

/****************** LPTIM Instances : supporting Input Capture ****************/
#define IS_LPTIM_INPUT_CAPTURE_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1)

/****************** LPTIM Instances : supporting Input1 ***********************/
#define IS_LPTIM_INPUT1_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1)

/******************************* SPI Instances ********************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE)     (((INSTANCE) == SPI1) || ((INSTANCE) == SPI2))

/******************************** I2S Instances *******************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE)   (((INSTANCE) == SPI1) || \
                                         ((INSTANCE) == SPI2))

/***************************** TAMP Instances  ********************************/
#define IS_TAMP_INSTANCE(INSTANCE)  ((INSTANCE) == TAMP)

/****************** TIM Instances : All supported instances *******************/
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM6)  || \
                                         ((INSTANCE) == TIM7)  || \
                                         ((INSTANCE) == TIM8)  || \
                                         ((INSTANCE) == TIM12) || \
                                         ((INSTANCE) == TIM15))
/****************** TIM Instances : supporting 32 bits counter ****************/
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (((INSTANCE) == TIM2))
/****************** TIM Instances : supporting the break function *************/
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM8)  || \
                                            ((INSTANCE) == TIM15))
/************** TIM Instances : supporting Break source selection *************/
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)  || \
                                               ((INSTANCE) == TIM8)  || \
                                               ((INSTANCE) == TIM15))
/****************** TIM Instances : supporting 2 break inputs *****************/
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM8))

/************* TIM Instances : at least 1 capture/compare channel *************/
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM8)  || \
                                         ((INSTANCE) == TIM12) || \
                                         ((INSTANCE) == TIM15))
/************ TIM Instances : at least 2 capture/compare channels *************/
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM8)  || \
                                         ((INSTANCE) == TIM12) || \
                                         ((INSTANCE) == TIM15))
/************ TIM Instances : at least 3 capture/compare channels *************/
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM8))
/************ TIM Instances : at least 4 capture/compare channels *************/
#define IS_TIM_CC4_INSTANCE(INSTANCE)   IS_TIM_CC3_INSTANCE(INSTANCE)

/****************** TIM Instances : at least 5 capture/compare channels *******/
#define IS_TIM_CC5_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM8))

/****************** TIM Instances : at least 6 capture/compare channels *******/
#define IS_TIM_CC6_INSTANCE(INSTANCE)   IS_TIM_CC5_INSTANCE(INSTANCE)

/****************** TIM Instances : at least 7 capture/compare channels *******/
#define IS_TIM_CC7_INSTANCE(INSTANCE)   IS_TIM_CC6_INSTANCE(INSTANCE)

/****** TIM Instances : at least 1 capture/compare complementary channel ******/
#define IS_TIM_CC1N_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM8)  || \
                                         ((INSTANCE) == TIM15))
/****** TIM Instances : at least 2 capture/compare complementary channel ******/
#define IS_TIM_CC2N_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                         ((INSTANCE) == TIM8))

